["Arrays.","Base (i.e., lower-level) array utilities.","Convert an array-like object to an object likely to have the same \"shape\".","Copy the elements of an array-like object to a new generic array.","Create a filled generic array.","Create a filled generic array according to a provided callback function.","Generate a linearly spaced numeric array according to a provided increment.","Generate a linearly spaced numeric array.","Generate a logarithmically spaced numeric array.","Create a generic array filled with ones.","Generate a linearly spaced numeric array whose elements increment by 1.","Create a zero-filled generic array.","ArrayBuffer.","Complex128Array.","Complex64Array.","Convert an array to an array of a different data type.","Convert an array to the same data type as a second input array.","Array constructors.","DataView.","Generate an array of linearly spaced dates.","Return the data type of an array.","List of array data types.","Create a filled array.","Create a filled array according to a provided callback function.","Float32Array.","Float64Array.","Create (or fill) an array from an iterator.","Create a filled array having a specified length.","Create a filled array having the same length and data type as a provided array.","Generate a linearly spaced numeric array using a provided increment.","Int16Array.","Int32Array.","Int8Array.","Generate a linearly spaced array over a specified interval.","Generate a logarithmically spaced numeric array.","Determine the minimum array data type of the closest kind necessary for storing a provided scalar value.","Return the next larger array data type of the same kind.","Create an array filled with ones and having a specified length.","Create an array filled with ones and having the same length and data type as a provided array.","Typed array pool.","Return the array data type with the smallest size and closest kind to which array data types can be safely cast.","Revive a JSON-serialized typed array.","Return a list of array data types to which a provided array data type can be safely cast.","Return a list of array data types to which a provided array data type can be safely cast or cast within the same kind.","Determine (nested) array dimensions.","SharedArrayBuffer.","Create an iterator which repeatedly iterates over the elements of an array-like object.","Create an iterator from an array-like object.","Create an iterator from an array-like object, iterating from right to left.","Return a JSON representation of a typed array.","Create an iterator from a sparse array-like object.","Create an iterator from a sparse array-like object, iterating from right to left.","Create an iterator from a strided array-like object.","Create an iterator from an array-like object view.","Create an iterator from an array-like object view, iterating from right to left.","Create a typed array.","Create a complex number typed array.","Complex typed array constructors.","List of complex typed array data types.","Typed array constructors.","List of typed array data types.","Floating-point typed array constructors.","List of typed array floating-point data types.","Integer-valued typed array constructors.","List of typed array integer data types.","Create a typed array.","Typed array constructors.","List of typed array data types.","Real-valued floating-point typed array constructors.","List of typed array real-valued floating-point data types.","Signed integer typed array constructors.","List of typed array signed integer data types.","Unsigned integer typed array constructors.","List of typed array unsigned integer data types.","Uint16Array.","Uint32Array.","Uint8Array.","Uint8ClampedArray.","Create a zero-filled array having a specified length.","Create a zero-filled array having the same length and data type as a provided array.","Standard assertion utilities.","Test if an array-like value contains a search value.","Test for deep equality between two values.","Test whether an object contains a nested key path.","Test whether an object contains a nested key path, either own or inherited.","Detect native ArrayBuffer support.","Detect native arrow function support.","Detect native async/await support.","Detect native Symbol.asyncIterator support.","Detect native BigInt support.","Detect native BigInt64Array support.","Detect native BigUint64Array support.","Detect native class support.","Detect native ArrayBuffer support.","Detect Object.defineProperties support.","Detect Object.defineProperty support.","Detect native Float32Array support.","Detect native Float64Array support.","Detect native function name support.","Detect native generator function support.","Detect globalThis support.","Detect native Int16Array support.","Detect native Int32Array support.","Detect native Int8Array support.","Detect native Symbol.iterator support.","Detect native Map support.","Detect native Buffer support.","Test if an object has a specified property.","Test if an object has a specified property, either own or inherited.","Detect native Proxy function support.","Detect native Set support.","Detect native SharedArrayBuffer support.","Detect native Symbol support.","Detect native Symbol.toStringTag support.","Detect native Uint16Array support.","Detect native Uint32Array support.","Detect native Uint8Array support.","Detect native Uint8ClampedArray support.","Test if a position in a string marks the start of a UTF-16 surrogate pair.","Detect native WebAssembly support.","Detect native WeakMap support.","Detect native WeakSet support.","Test whether a value has in its prototype chain a specified constructor as a prototype property.","Test whether a value is an absolute HTTP(S) URI.","Test if a value is an absolute path.","Test whether a value is an absolute URI.","Test if an object's own property has an accessor descriptor.","Test if an object's own or inherited property has an accessor descriptor.","Test if a value is an alphagram.","Test whether a string contains only alphanumeric characters.","Test if a value is an anagram.","Test if a value is an arguments object.","Test if a value is an array.","Test if a value is an array of arrays.","Test if a value is a valid array length.","Test if a value is array-like.","Test if a value is an array-like object.","Test if a value is an ArrayBuffer.","Test if a value is an ArrayBuffer view.","Test if a value is an arrow function.","Test whether a character belongs to the ASCII character set and whether this is true for all characters in a provided string.","Test if a value is between two values.","Test if a value is an array-like object where every element is between two values.","Check if an environment is big endian.","Test if a value is a BigInt.","Test if a value is a BigUint64Array.","Test if a value is a BigUint64Array.","Test if a value is a binary string.","Test if a value is a blank string.","Test if a value is a boolean.","Test if a value is an array-like object of booleans.","Test if a value is a JavaScript boxed primitive.","Check if the runtime is a web browser.","Test if a value is a Buffer object.","Test if a value is a string having an uppercase first character.","Test if a value is a centrosymmetric matrix.","Test if an object-like value contains a circular reference.","Test if a value is an array containing a circular reference.","Test if a value is a plain object containing a circular reference.","Test if a value is a class.","Test if a value is a collection.","Test if a value is a 64-bit or 128-bit complex number.","Test if a value is a complex number-like object.","Test if a value is a complex typed array.","Test if a value is complex-typed-array-like.","Test if a value is a 128-bit complex number.","Test if a value is a Complex128Array.","Test if a value is a 64-bit complex number.","Test if a value is a Complex64Array.","Test if a value is a composite number.","Test if an object's own property is configurable.","Test if an object's own or inherited property is configurable.","Test if a value is a cube number.","Boolean indicating if the current process is running on Darwin.","Test if an object's own property has a data descriptor.","Test if an object's own or inherited property has a data descriptor.","Test if a value is a DataView.","Test if a value is a Date object.","Test if a value is an array-like object containing only Date objects.","Test whether a string contains only numeric digits.","Check if the process is running in a Docker container.","Check if the runtime is Electron.","Check if the runtime is the main Electron process.","Check if the runtime is the Electron renderer process.","Test if a value is an email address.","Test if a value is an empty array.","Test if a value is an empty array-like object.","Test if a value is an empty collection.","Test if a value is an empty object.","Test if a value is an empty string.","Test if an object's own property is enumerable.","Test if an object's own or inherited property is enumerable.","Test if a value is an Error object.","Test if a value is an EvalError object.","Test if a value is an even number.","Test if a value is falsy.","Test if a value is an array-like object containing only falsy values.","Test if a value is a finite number.","Test if a value is an array-like object containing only finite numbers.","Test if a value is a Float32Array.","Test if a value is a 2-dimensional ndarray-like object containing single-precision floating-point numbers.","Test if a value is an ndarray-like object containing single-precision floating-point numbers.","Test if a value is a 1-dimensional ndarray-like object containing single-precision floating-point numbers.","Test if a value is a Float64Array.","Test if a value is a 2-dimensional ndarray-like object containing double-precision floating-point numbers.","Test if a value is an ndarray-like object containing double-precision floating-point numbers.","Test if a value is a 1-dimensional ndarray-like object containing double-precision floating-point numbers.","Test if a value is a function.","Test if a value is an array-like object containing only functions.","Test if a value is a generator object.","Test if a value is generator object-like.","Test if a value is a gzip buffer.","Test whether a string contains only hexadecimal digits.","Test if a value is an infinite number.","Test if an object has an inherited property.","Test if a value is an Int16Array.","Test if a value is an Int32Array.","Test if a value is an Int8Array.","Test if a value is a number having an integer value.","Test if a value is an array-like object containing only integers.","Test if a value is iterable-like.","Test if a value is iterator-like.","Test if a value is a parseable JSON string.","Test if a value corresponds to a leap year in the Gregorian calendar.","Check if an environment is little endian.","Test whether a value is a localhost hostname.","Test if a value is a lowercase string.","Test if a value is a 2-dimensional ndarray-like object.","Test if an object has a specified method name.","Test if an object has a specified method name, either own or inherited.","Boolean indicating if the current environment is a mobile device.","Test if a value is named typed tuple-like.","Test if a value is NaN.","Test if a value is an array-like object containing only NaN values.","Test if a value is a native function.","Test if a value is ndarray-like.","Test if a value is a number having a negative integer value.","Test if a value is an array-like object containing only negative integers.","Test if a value is a number having a negative value.","Test if a value is an array-like object containing only negative numbers.","Test if a value is equal to negative zero.","Check if the runtime is Node.js.","Test whether a string matches a Node.js built-in module name.","Test if a value is Node duplex stream-like.","Test if a value is Node readable stream-like.","Check if running in a Node.js REPL environment.","Test if a value is Node stream-like.","Test if a value is Node transform stream-like.","Test if a value is Node writable stream-like.","Test if an object's own property is non-configurable.","Test if an object's own or inherited property is non-configurable.","Test if an object's own property is non-enumerable.","Test if an object's own or inherited property is non-enumerable.","Test if a value is a number having a nonnegative integer value.","Test if a value is an array-like object containing only nonnegative integers.","Test if a value is a number having a nonnegative value.","Test if a value is an array-like object containing only nonnegative numbers.","Test if a value is a number having a nonpositive integer value.","Test if a value is an array-like object containing only nonpositive integers.","Test if a value is a number having a nonpositive value.","Test if a value is an array-like object containing only nonpositive numbers.","Test if a value is a non-symmetric matrix.","Test if a value is null.","Test if a value is an array-like object containing only null values.","Test if a value is a number.","Test if a value is an array-like object of numbers.","Test if a value is a numeric array.","Test if a value is an object.","Test if a value is an array-like object containing only objects.","Test if a value is object-like.","Test if a value is an odd number.","Test if a value is a persymmetric matrix.","Test if a value is a plain object.","Test if a value is an array-like object containing only plain objects.","Test if a value is a number having a positive integer value.","Test if a value is an array-like object containing only positive integers.","Test if a value is a number having a positive value.","Test if a value is an array-like object containing only positive numbers.","Test if a value is equal to positive zero.","Test if a value is a prime number.","Test if a value is a JavaScript primitive.","Test if a value is an array-like object containing only JavaScript primitives.","Test if a value is PRNG-like.","Test if a value is a probability.","Test if a value is an array-like object containing only probabilities.","Test whether a value is a property key.","Test if an object's prototype chain contains a provided prototype.","Test if a value is a RangeError object.","Test if an object's own property is read-only.","Test if an object's own or inherited property is read-only.","Test if an object's own property is readable and writable.","Test if an object's own and inherited property is readable and writable.","Test if an object's own property is readable.","Test if an object's own or inherited property is readable.","Test if a value is a ReferenceError object.","Test if a value is a regular expression.","Test if a value is a regular expression string.","Test if a value is a relative path.","Test whether a value is a relative URI.","Test if a value is a number having a safe integer value.","Test if a value is an array-like object containing only safe integers.","Test if two arguments have the same native class.","Test if two arguments have the same type.","Test if two arguments are the same value.","Test if two arguments are the same value.","Test if a value is a SharedArrayBuffer.","Test if a value is a skew-centrosymmetric matrix.","Test if a value is a skew-persymmetric matrix.","Test if a value is a skew-symmetric matrix.","Test if a value is a 2-dimensional ndarray-like object having equal dimensions.","Test if a value is a square number.","Test if a value is a square triangular number.","Test if two arguments are strictly equal.","Test if a value is a string.","Test if a value is an array of strings.","Test if a value is a symbol.","Test if a value is an array-like object containing only symbols.","Test if a value is a symmetric matrix.","Test if a value is a SyntaxError object.","Boolean indicating if the current environment is a touch device.","Test if a value is a triangular number.","Test if a value is truthy.","Test if a value is an array-like object containing only truthy values.","Test if a value is a TypeError object.","Test if a value is a typed array.","Test if a value is a valid typed array length.","Test if a value is typed-array-like.","Test if a value is a Uint16Array.","Test if a value is a Uint32Array.","Test if a value is a Uint8Array.","Test if a value is a Uint8ClampedArray.","Test if a value is a UNC path.","Test if a value is undefined.","Test if a value is undefined or null.","Test if a value is an array of probabilities that sum to one.","Test if a value is an uppercase string.","Test if a value is a URI.","Test if a value is a URIError object.","Test if a value is a 1-dimensional ndarray-like object.","Check if the runtime is a web worker.","Test whether a string contains only white space characters.","Boolean indicating if the current process is running on Windows.","Test if an object's own property is writable.","Test if an object's own or inherited property is writable.","Test if an object's own property is write-only.","Test if an object's own or inherited property is write-only.","Assertion utility tools.","Return a function which tests if every element in an array passes a test condition.","Return a function which tests if every element in an array-like object passes a test condition.","Return a function which tests if every element in a typed array passes a test condition.","Benchmark harness.","Benchmark harness.","BigInt.","BigInts.","BLAS.","Base (i.e., lower-level) basic linear algebra subprograms (BLAS).","Copy values from one complex single-precision floating-point vector to another complex single-precision floating-point vector.","Interchanges two complex single-precision floating-point vectors.","Compute the sum of absolute values (L1 norm).","Multiply a vector x by a constant and add the result to y.","Copy values from x into y.","Calculate the dot product of two double-precision floating-point vectors.","Calculate the L2-norm of a double-precision floating-point vector.","Multiply a double-precision floating-point vector by a constant.","Calculate the dot product with extended accumulation and result of two single-precision floating-point vectors.","Interchange two double-precision floating-point vectors.","Compute the sum of absolute values (L1 norm).","Multiply x by a constant and add the result to y.","Copy values from x into y.","Calculate the dot product of two vectors.","Calculate the L2-norm of a vector.","Multiply a vector by a constant.","Interchange two vectors.","Compute the sum of absolute values (L1 norm).","Multiply a vector x by a constant and add the result to y.","Copy values from x into y.","Calculate the dot product of two single-precision floating-point vectors.","Calculate the dot product of two single-precision floating-point vectors with extended accumulation.","Calculate the L2-norm of a single-precision floating-point vector.","Multiply a single-precision floating-point vector by a constant.","Interchange two single-precision floating-point vectors.","Calculate the dot product of two double-precision floating-point vectors.","Interchange two double-precision floating-point vectors.","Extended BLAS.","Extended base (i.e., lower-level) basic linear algebra subroutines (BLAS).","Add a constant to each element in a double-precision floating-point strided array.","Adds a constant to each double-precision floating-point strided array element and computes the sum.","Adds a constant to each double-precision floating-point strided array element and computes the sum using an improved Kahan–Babuška algorithm.","Adds a constant to each double-precision floating-point strided array element and computes the sum using a second-order iterative Kahan–Babuška algorithm.","Adds a constant to each double-precision floating-point strided array element and computes the sum using ordinary recursive summation.","Adds a constant to each double-precision floating-point strided array element and computes the sum using pairwise summation.","Calculate the sum of absolute values (L1 norm) of double-precision floating-point strided array elements using pairwise summation.","Calculate the cumulative sum of double-precision floating-point strided array elements.","Calculate the cumulative sum of double-precision floating-point strided array elements using an improved Kahan–Babuška algorithm.","Calculate the cumulative sum of double-precision floating-point strided array elements using a second-order iterative Kahan–Babuška algorithm.","Calculate the cumulative sum of double-precision floating-point strided array elements using ordinary recursive summation.","Calculate the cumulative sum of double-precision floating-point strided array elements using pairwise summation.","Fill a double-precision floating-point strided array with a specified scalar constant.","Calculate the sum of absolute values (L1 norm) of double-precision floating-point strided array elements, ignoring NaN values.","Calculate the sum of absolute values (L1 norm) of double-precision floating-point strided array elements, ignoring NaN values and using ordinary recursive summation.","Calculate the sum of double-precision floating-point strided array elements, ignoring NaN values.","Calculate the sum of double-precision floating-point strided array elements, ignoring NaN values and using an improved Kahan–Babuška algorithm.","Calculate the sum of double-precision floating-point strided array elements, ignoring NaN values and using a second-order iterative Kahan–Babuška algorithm.","Calculate the sum of double-precision floating-point strided array elements, ignoring NaN values and using ordinary recursive summation.","Calculate the sum of double-precision floating-point strided array elements, ignoring NaN values and using pairwise summation.","Calculate the sum of double-precision floating-point strided array elements, ignoring NaN values.","Calculate the sum of double-precision floating-point strided array elements, ignoring NaN values and using an improved Kahan–Babuška algorithm.","Calculate the sum of double-precision floating-point strided array elements, ignoring NaN values and using a second-order iterative Kahan–Babuška algorithm.","Calculate the sum of double-precision floating-point strided array elements, ignoring NaN values and using ordinary recursive summation.","Calculate the sum of double-precision floating-point strided array elements, ignoring NaN values and using pairwise summation.","Reverse a double-precision floating-point strided array in-place.","Adds a constant to each single-precision floating-point strided array element and computes the sum using extended accumulation and returning an extended precision result.","Adds a constant to each single-precision floating-point strided array element and computes the sum using pairwise summation with extended accumulation and returning an extended precision result.","Calculate the sum of single-precision floating-point strided array elements, ignoring NaN values, using ordinary recursive summation with extended accumulation, and returning an extended precision result.","Calculate the sum of single-precision floating-point strided array elements, ignoring NaN values, using extended accumulation, and returning an extended precision result.","Calculate the sum of single-precision floating-point strided array elements, ignoring NaN values, using ordinary recursive summation with extended accumulation, and returning an extended precision result.","Calculate the sum of single-precision floating-point strided array elements, ignoring NaN values, using pairwise summation with extended accumulation, and returning an extended precision result.","Simultaneously sort two double-precision floating-point strided arrays based on the sort order of the first array using heapsort.","Simultaneously sort two double-precision floating-point strided arrays based on the sort order of the first array using insertion sort.","Simultaneously sort two double-precision floating-point strided arrays based on the sort order of the first array using Shellsort.","Sort a double-precision floating-point strided array using heapsort.","Sort a double-precision floating-point strided array using insertion sort.","Sort a double-precision floating-point strided array using Shellsort.","Calculate the sum of single-precision floating-point strided array elements using extended accumulation and returning an extended precision result.","Calculate the sum of single-precision floating-point strided array elements using ordinary recursive summation with extended accumulation and returning an extended precision result.","Calculate the sum of single-precision floating-point strided array elements using pairwise summation with extended accumulation and returning an extended precision result.","Calculate the sum of double-precision floating-point strided array elements.","Calculate the sum of double-precision floating-point strided array elements using an improved Kahan–Babuška algorithm.","Calculate the sum of double-precision floating-point strided array elements using a second-order iterative Kahan–Babuška algorithm.","Calculate the sum of double-precision floating-point strided array elements using ordinary recursive summation.","Calculate the sum of double-precision floating-point strided array elements using pairwise summation.","Add a constant to each element in a strided array.","Adds a constant to each strided array element and computes the sum.","Adds a constant to each strided array element and computes the sum using an improved Kahan–Babuška algorithm.","Adds a constant to each strided array element and computes the sum using a second-order iterative Kahan–Babuška algorithm.","Adds a constant to each strided array element and computes the sum using ordinary recursive summation.","Adds a constant to each strided array element and computes the sum using pairwise summation.","Calculate the sum of absolute values (L1 norm) of strided array elements using pairwise summation.","Calculate the cumulative sum of strided array elements.","Calculate the cumulative sum of strided array elements using an improved Kahan–Babuška algorithm.","Calculate the cumulative sum of strided array elements using a second-order iterative Kahan–Babuška algorithm.","Calculate the cumulative sum of strided array elements using ordinary recursive summation.","Calculate the cumulative sum of strided array elements using pairwise summation.","Fill a strided array with a specified scalar constant.","Fill a strided array according to a provided callback function.","Calculate the sum of strided array elements, ignoring NaN values and using an improved Kahan–Babuška algorithm.","Calculate the sum of strided array elements, ignoring NaN values.","Calculate the sum of strided array elements, ignoring NaN values and using an improved Kahan–Babuška algorithm.","Calculate the sum of strided array elements, ignoring NaN values and using a second-order iterative Kahan–Babuška algorithm.","Calculate the sum of strided array elements, ignoring NaN values and using ordinary recursive summation.","Calculate the sum of strided array elements, ignoring NaN values and using pairwise summation.","Reverse a strided array in-place.","Simultaneously sort two strided arrays based on the sort order of the first array using heapsort.","Simultaneously sort two strided arrays based on the sort order of the first array using insertion sort.","Simultaneously sort two strided arrays based on the sort order of the first array using Shellsort.","Sort a strided array using heapsort.","Sort a strided array using insertion sort.","Sort a strided array using Shellsort.","Calculate the sum of strided array elements.","Calculate the sum of strided array elements using an improved Kahan–Babuška algorithm.","Calculate the sum of strided array elements using a second-order iterative Kahan–Babuška algorithm.","Calculate the sum of strided array elements using ordinary recursive summation.","Calculate the sum of strided array elements using pairwise summation.","Add a constant to each element in a single-precision floating-point strided array.","Adds a constant to each single-precision floating-point strided array element and computes the sum.","Adds a constant to each single-precision floating-point strided array element and computes the sum using an improved Kahan–Babuška algorithm.","Adds a constant to each single-precision floating-point strided array element and computes the sum using a second-order iterative Kahan–Babuška algorithm.","Adds a constant to each single-precision floating-point strided array element and computes the sum using ordinary recursive summation.","Adds a constant to each single-precision floating-point strided array element and computes the sum using pairwise summation.","Calculate the sum of absolute values (L1 norm) of single-precision floating-point strided array elements using pairwise summation.","Calculate the cumulative sum of single-precision floating-point strided array elements.","Calculate the cumulative sum of single-precision floating-point strided array elements using an improved Kahan–Babuška algorithm.","Calculate the cumulative sum of single-precision floating-point strided array elements using a second-order iterative Kahan–Babuška algorithm.","Calculate the cumulative sum of single-precision floating-point strided array elements using ordinary recursive summation.","Calculate the cumulative sum of single-precision floating-point strided array elements using pairwise summation.","Adds a constant to each single-precision floating-point strided array element and computes the sum using extended accumulation.","Adds a constant to each single-precision floating-point strided array element and computes the sum using pairwise summation with extended accumulation.","Calculate the sum of single-precision floating-point strided array elements, ignoring NaN values and using extended accumulation.","Calculate the sum of single-precision floating-point strided array elements, ignoring NaN values and using pairwise summation with extended accumulation.","Calculate the sum of single-precision floating-point strided array elements using extended accumulation.","Calculate the sum of single-precision floating-point strided array elements using pairwise summation with extended accumulation.","Fill a single-precision floating-point strided array with a specified scalar constant.","Calculate the sum of single-precision floating-point strided array elements, ignoring NaN values.","Calculate the sum of single-precision floating-point strided array elements, ignoring NaN values and using an improved Kahan–Babuška algorithm.","Calculate the sum of single-precision floating-point strided array elements, ignoring NaN values and using a second-order iterative Kahan–Babuška algorithm.","Calculate the sum of single-precision floating-point strided array elements, ignoring NaN values and using ordinary recursive summation.","Calculate the sum of single-precision floating-point strided array elements, ignoring NaN values and using pairwise summation.","Reverse a single-precision floating-point strided array in-place.","Simultaneously sort two single-precision floating-point strided arrays based on the sort order of the first array using heapsort.","Simultaneously sort two single-precision floating-point strided arrays based on the sort order of the first array using insertion sort.","Simultaneously sort two single-precision floating-point strided arrays based on the sort order of the first array using Shellsort.","Sort a single-precision floating-point strided array using heapsort.","Sort a single-precision floating-point strided array using insertion sort.","Sort a single-precision floating-point strided array using Shellsort.","Calculate the sum of single-precision floating-point strided array elements.","Calculate the sum of single-precision floating-point strided array elements using an improved Kahan–Babuška algorithm.","Calculate the sum of single-precision floating-point strided array elements using a second-order iterative Kahan–Babuška algorithm.","Calculate the sum of single-precision floating-point strided array elements using ordinary recursive summation.","Calculate the sum of single-precision floating-point strided array elements using pairwise summation.","Calculate the dot product of two vectors.","Interchange two vectors.","Calculate the dot product of two single-precision floating-point vectors.","Interchange two single-precision floating-point vectors.","Buffer.","Allocate a buffer having a specified number of bytes.","Buffer.","Allocate a buffer using an octet array.","Allocate a buffer from an ArrayBuffer.","Copy buffer data to a new Buffer instance.","Allocate a buffer containing a provided string.","Revive a JSON-serialized Buffer.","Return a JSON representation of a Buffer.","Command-line interface.","Command-line interface.","Complex numbers.",null,"Wrap a function accepting complex number arguments to support providing both real and complex numbers.","Create a complex number.","Return the complex conjugate of a double-precision complex floating-point number.","Return the complex conjugate of a single-precision complex floating-point number.","Complex number constructors.","Return the data type of a complex number.","List of complex number data types.","64-bit complex number.","128-bit complex number.","Return the imaginary component of a double-precision complex floating-point number.","Return the imaginary component of a single-precision complex floating-point number.","Return the complex number data type with the smallest size and closest kind to which data types can be safely cast.","Return the real component of a double-precision complex floating-point number.","Return the real component of a single-precision complex floating-point number.","Return the real and imaginary components of a double-precision complex floating-point number.","Return the real and imaginary components of a single-precision complex floating-point number.","Revive a JSON-serialized complex number.","Revive a JSON-serialized 64-bit complex number.","Revive a JSON-serialized 128-bit complex number.","Constants.","Array constants.","Maximum length for a generic array.","Maximum length for a typed array.","128-bit complex number mathematical constants.","Size (in bytes) of a 128-bit complex number.","64-bit complex number mathematical constants.","Size (in bytes) of a 64-bit complex number.","Half-precision floating-point mathematical constants.","Cube root of half-precision floating-point epsilon.","Difference between one and the smallest value greater than one that can be represented as a half-precision floating-point number.","The bias of a half-precision floating-point number's exponent.","Maximum half-precision floating-point number.","Maximum safe half-precision floating-point integer.","Minimum safe half-precision floating-point integer.","Half-precision floating-point negative infinity.","Size (in bytes) of a half-precision floating-point number.","Half-precision floating-point positive infinity.","Effective number of bits in the significand of a half-precision floating-point number.","Smallest positive normalized half-precision floating-point number.","Smallest positive half-precision floating-point subnormal number.","Square root of half-precision floating-point epsilon.","Single-precision floating-point mathematical constants.","Cube root of single-precision floating-point epsilon.","Difference between one and the smallest value greater than one that can be represented as a single-precision floating-point number.","The bias of a single-precision floating-point number's exponent.","Maximum single-precision floating-point number.","Maximum safe single-precision floating-point integer.","Minimum safe single-precision floating-point integer.","Single-precision floating-point negative infinity.","Size (in bytes) of a single-precision floating-point number.","Single-precision floating-point positive infinity.","Effective number of bits in the significand of a single-precision floating-point number.","Smallest positive normalized single-precision floating-point number.","Smallest positive single-precision floating-point subnormal number.","Square root of single-precision floating-point epsilon.","Double-precision floating-point mathematical constants.","Apéry's constant.","Catalan's constant.","Cube root of double-precision floating-point epsilon.","Euler's number.","Difference between one and the smallest value greater than one that can be represented as a double-precision floating-point number.","The Euler-Mascheroni constant.","The bias of a double-precision floating-point number's exponent.","1/4 times π.","Fourth root of double-precision floating-point epsilon.","Arbitrary constant g to be used in Lanczos approximation functions.","Glaisher-Kinkelin constant.","One half times the natural logarithm of 2.","1/2 times π.","High word mask for the exponent of a double-precision floating-point number.","High word mask for the significand of a double-precision floating-point number.","Natural logarithm of 1/2.","Natural logarithm of π.","Natural logarithm of the square root of 2π.","Natural logarithm of 10.","Natural logarithm of 2.","Natural logarithm of 2π.","Base 10 logarithm of Euler's number.","Base 2 logarithm of Euler's number.","Maximum double-precision floating-point number.","The maximum base 10 exponent for a double-precision floating-point number.","The maximum base 10 exponent for a subnormal double-precision floating-point number.","The maximum biased base 2 exponent for a double-precision floating-point number.","The maximum biased base 2 exponent for a subnormal double-precision floating-point number.","Natural logarithm of the maximum double-precision floating-point number.","Maximum safe Fibonacci number when stored in double-precision floating-point format.","Maximum safe double-precision floating-point integer.","Maximum safe Lucas number when stored in double-precision floating-point format.","Maximum safe nth Fibonacci number when stored in double-precision floating-point format.","Maximum safe nth Lucas number when stored in double-precision floating-point format.","The minimum base 10 exponent for a normal double-precision floating-point number.","The minimum base 10 exponent for a subnormal double-precision floating-point number.","The minimum biased base 2 exponent for a normal double-precision floating-point number.","The minimum biased base 2 exponent for a subnormal double-precision floating-point number.","Natural logarithm of the smallest normalized double-precision floating-point number.","Minimum safe double-precision floating-point integer.","Double-precision floating-point negative infinity.","Size (in bytes) of a double-precision floating-point number.","Golden ratio.","π.","π².","Positive infinity.","Effective number of bits in the significand of a double-precision floating-point number.","Smallest positive double-precision floating-point normal number.","Smallest positive double-precision floating-point number.","Square root of double-precision floating-point epsilon.","Square root of 1/2.","Square root of 0.5π.","Square root of the golden ratio.","Square root of π.","Square root of 3.","Square root of 2.","Square root of 2π.","2π.","16-bit signed integer mathematical constants.","Maximum signed 16-bit integer.","Minimum signed 16-bit integer.","Size (in bytes) of a 16-bit signed integer.","32-bit signed integer mathematical constants.","Maximum signed 32-bit integer.","Minimum signed 32-bit integer.","Size (in bytes) of a 32-bit signed integer.","8-bit signed integer mathematical constants.","Maximum signed 8-bit integer.","Minimum signed 8-bit integer.","Size (in bytes) of an 8-bit signed integer.","Standard string path constants.","Platform-specific path delimiter.","POSIX path delimiter.","Windows path delimiter.","Platform-specific path segment separator.","POSIX path segment separator.","Windows path segment separator.","Time constants.","Number of hours in a day.","Number of hours in a week.","Number of milliseconds in a day.","Number of milliseconds in an hour.","Number of milliseconds in a minute.","Number of milliseconds in a second.","Number of milliseconds in a week.","Number of minutes in a day.","Number of minutes in an hour.","Number of minutes in a week.","Number of months in a year.","Number of seconds in a day.","Number of seconds in an hour.","Number of seconds in a minute.","Number of seconds in a week.","16-bit unsigned integer mathematical constants.","Maximum unsigned 16-bit integer.","Size (in bytes) of a 16-bit unsigned integer.","32-bit unsigned integer mathematical constants.","Maximum unsigned 32-bit integer.","Size (in bytes) of a 32-bit unsigned integer.","8-bit unsigned integer mathematical constants.","Maximum unsigned 8-bit integer.","Size (in bytes) of an 8-bit unsigned integer.","Standard string unicode constants.","Maximum Unicode code point.","Maximum Unicode code point in the Basic Multilingual Plane (BMP).","Datasets.","A list of English words rated for valence.","A list of English words rated for valence.","Anscombe's quartet.","A random sample of 534 workers from the Current Population Survey (CPS) from 1985.","US birth data from 1969 to 1988, as provided by the Center for Disease Control and Prevention's National Center for Health Statistics.","US birth data from 1994 to 2003, as provided by the Center for Disease Control and Prevention's National Center for Health Statistics.","US infant mortality data, by race, from 1915 to 2013, as provided by the Center for Disease Control and Prevention's National Center for Health Statistics.","The Carnegie Mellon Pronouncing Dictionary (CMUdict).","A list of familiar American-English words.","Emoji.","Emoji codes and pictographs.","Emoji pictographs and codes.","A list of common female first names in English speaking countries.","FiveThirtyEight reader responses to a food frequency questionnaire (FFQ).","Wage rates for U.S. workers that have not changed jobs within the year.","A dataset derived from information collected by the US Census Service concerning housing in Boston, Massachusetts (1978).","A (corrected) dataset derived from information collected by the US Census Service concerning housing in Boston, Massachusetts (1978).","Fifteen observations of the vertical semidiameter of Venus, made by Lieutenant Herndon, with the meridian circle at Washington, in the year 1846.","Acanthus mollis.","Image of an airplane, viewed from above looking down.","Allium oreophilum (pink lily leek).","Image of Black Canyon.","Image of an abandoned Dust Bowl home.","Image of a French alpine landscape.","Twenty-four views of a house cat.","Forty-eight views of a nude male moving in place.","Image of sheep in a pastoral setting.","Image of boats in a river in Nagasaki.","A list of negative opinion words.","A list of positive opinion words.","A list of common male first names in English speaking countries.","Data for Charles Joseph Minard's cartographic depiction of Napoleon's Russian campaign of 1812.","The text of Moby Dick by Herman Melville.","A list of month names (English).","Dataset for Nightingale's famous polar area diagram.","A (corrected) dataset derived from information collected by the US Census Service concerning housing in Boston, Massachusetts (1978).","The first 100,000 prime numbers.","A list of Finnish stop words.","A list of French stop words.","A list German stop words.","A list of Italian stop words.","A list of Portuguese stop words.","A list of Spanish stop words.","A list of Swedish stop words.","State of the Union addresses by U.S. Presidents.","A list of simple American-English words (revised Spache).","Spam Assassin public mail corpus.","US birth data from 2000 to 2014, as provided by the Social Security Administration.","A list of cards.","A list of English stop words.","Labeled wireless sensor network data set collected from a multi-hop wireless sensor network deployment using TelosB motes.","Labeled wireless sensor network data set collected from a simple single-hop wireless sensor network deployment using TelosB motes.","A list of US state two-letter abbreviations in alphabetical order according to state name.","A list of US state capitals in alphabetical order according to state name.","US state capitals and names.","A list of US state names in alphabetical order.","US state names and capitals.","Errors.","Revive a JSON-serialized error object.","Return a JSON representation of an error object.","Error tools.","Standard library error code database.","Format an error message for production.","Return a function which formats an error message for production.","Return an error message corresponding to a provided two-character error identifier.","Return the package name associated with a specified error identifier prefix.","Return a two-character error identifier corresponding to a provided error message.","Return the error identifier prefix associated with a specified package name.","Filesystem APIs.","Close a file descriptor.","Test whether a path exists on the filesystem.","Open a file.","Read the entire contents of a directory.","Read the entire contents of a file.","Read the entire contents of each file in a file list.","Read a file as JSON.","Read a file as WebAssembly.","Rename a file.","Resolve a path by walking parent directories.","Resolve a path according to a predicate function by walking parent directories.","Remove a directory entry.","Write data to a file.","Standard iterator utilities.","Advances an iterator.","Test whether at least one iterated value is truthy.","Test whether at least one iterated value passes a test implemented by a predicate function.","Create an iterator which iterates over the values of two or more iterators.","Create an iterator which always returns the same value.","Create an iterator which iteratively returns the number of iterated values.","Create an iterator which returns evenly spaced dates over a specified interval.","Create an iterator which removes consecutive duplicated values.","Create an iterator which removes consecutive values that resolve to the same value according to a provided function.","Create an empty iterator.","Test whether all iterated values are truthy.","Test whether every iterated value passes a test implemented by a predicate function.","Create an iterator which replaces all values from a provided iterator from a start index to an end index with a static value.","Create an iterator which filters the values of another iterator according to a predicate function.","Create an iterator which both filters and maps the values of another iterator.","Return the first iterated value.","Create a fluent interface for chaining together iterator methods.","Create an iterator which invokes a function for each iterated value before returning the iterated value.","Create an iterator which returns the first n values of a provided iterator.","Create an iterator which returns evenly spaced numbers according to a specified increment.","Create an iterator which returns the intersection of two or more iterators.","Create an iterator which returns the intersection of two or more iterators according to a hash function.","Consume an entire iterator and return the last iterated value.","Return an iterator's length.","Create an iterator which returns evenly spaced numbers over a specified interval.","Create an iterator which returns evenly spaced numbers on a log scale.","Create an iterator which invokes a function for each iterated value.","Create an iterator which transforms iterated values from two or more iterators by applying the iterated values as arguments to a provided function.","Test whether all iterated values are falsy.","Test whether every iterated value fails a test implemented by a predicate function.","Return the nth iterated value.","Create an iterator pipeline.","Create an iterator thunk.","Create an iterator which skips the last value of a provided iterator.","Create an iterator which appends additional values to the end of a provided iterator.","Create an iterator which rejects the values of another iterator according to a predicate function.","Create an iterator which replicates each iterated value a specified number of times.","Create an iterator which replicates each iterated value according to a provided function.","Create an iterator which skips the first value of a provided iterator.","Create an iterator which returns a subsequence of iterated values from a provided iterator.","Test whether at least n iterated values are truthy.","Test whether at least n iterated values pass a test implemented by a predicate function.","Create an iterator which returns a sequence of numbers according to a specified increment.","Create an iterator which steps by a specified amount.","Create an iterator which steps according to a provided callback function.","Fill an array-like object view with values returned from an iterator.","Fill an array-like object view from right to left with values returned from an iterator.","Create an iterator which returns the union of two or more iterators.","Create an iterator which returns unique values.","Create an iterator which returns unique values according to a predicate function.","Create an iterator which returns unique values according to a hash function.","Create an iterator which returns numbers incremented by one.","Create an iterator which prepends values to the beginning of a provided iterator.","Standard math.","Base (i.e., lower-level) math functions.","Base mathematical assertion utilities.","Test if a 32-bit integer is even.","Test if a 32-bit integer is odd.","Test if a number is composite.","Test if two numbers are coprime.","Test if a finite numeric value is an even number.","Test if a double-precision floating-point numeric value is finite.","Test if a single-precision floating-point numeric value is finite.","Test if a double-precision floating-point numeric value is infinite.","Test if a single-precision floating-point numeric value is infinite.","Test if a finite double-precision floating-point number is an integer.","Test if a double-precision floating-point numeric value is NaN.","Test if a single-precision floating-point numeric value is NaN.","Test if a finite double-precision floating-point number is a negative integer.","Test if a double-precision floating-point numeric value is negative zero.","Test if a single-precision floating-point numeric value is negative zero.","Test if a finite double-precision floating-point number is a nonnegative integer.","Test if a finite double-precision floating-point number is a nonpositive integer.","Test if a finite numeric value is an odd number.","Test if a finite double-precision floating-point number is a positive integer.","Test if a double-precision floating-point numeric value is positive zero.","Test if a single-precision floating-point numeric value is positive zero.","Test if a number is prime.","Test if a numeric value is a probability.","Test if a finite double-precision floating-point number is a safe integer.","Test whether an unsigned integer is a power of 2.","C APIs for registering a Node-API module exporting interfaces.","C APIs for registering a Node-API module exporting an interface for invoking a binary numerical function.","C APIs for registering a Node-API module exporting an interface for invoking a ternary numerical function.","C APIs for registering a Node-API module exporting an interface for invoking a unary numerical function.","Base (i.e., lower-level) math operators.","Compute the sum of two double-precision floating-point numbers.","Compute the sum of two single-precision floating-point numbers.","Add two double-precision complex floating-point numbers.","Add two single-precision complex floating-point numbers.","Divide two complex numbers.","Multiply two double-precision complex floating-point numbers.","Multiply two single-precision complex floating-point numbers.","Negate a complex number.","Subtract two double-precision complex floating-point numbers.","Subtract two single-precision complex floating-point numbers.","Perform C-like multiplication of two signed 32-bit integers.","Compute the double word product of two signed 32-bit integers.","Multiply two double-precision floating-point numbers.","Multiply two single-precision floating-point numbers.","Subtract two double-precision floating-point numbers.","Subtract two single-precision floating-point numbers.","Perform C-like multiplication of two unsigned 32-bit integers.","Compute the double word product of two unsigned 32-bit integers.","Base (i.e., lower-level) special math functions.","Compute the absolute value of a double-precision floating-point number.","Compute the squared absolute value of a double-precision floating-point number.","Compute the squared absolute value of a single-precision floating-point number.","Compute the absolute value of a single-precision floating-point number.","Compute the arccosine of a number.","Compute the hyperbolic arccosine of a number.","Compute the inverse cotangent.","Compute the inverse hyperbolic cotangent.","Compute the inverse coversed cosine.","Compute the inverse coversed sine.","Compute the arccosecant of a number.","Compute the hyperbolic arccosecant of a number.","Compute the inverse half-value versed cosine.","Compute the inverse half-value versed sine.","Compute the hyperbolic arcsecant of a number.","Compute the arcsine of a number.","Compute the hyperbolic arcsine of a number.","Compute the arctangent of a number.","Compute the angle in the plane (in radians) between the positive x-axis and the ray from (0,0) to the point (x,y).","Compute the hyperbolic arctangent of a number.","Compute the inverse versed cosine.","Compute the inverse versed sine.","Compute the nth Bernoulli number.","Compute the Bessel function of the first kind of order zero.","Compute the Bessel function of the first kind of order one.","Compute the Bessel function of the second kind of order zero.","Compute the Bessel function of the second kind of order one.","Beta function.","Incomplete beta function.","Inverse incomplete beta function.","Natural logarithm of the beta function.","Evaluate Binet's formula extended to real numbers.","Compute the binomial coefficient.","Compute the natural logarithm of the binomial coefficient.","Compute a one-parameter Box-Cox transformation.","Compute a one-parameter Box-Cox transformation of 1+x.","Compute the inverse of a one-parameter Box-Cox transformation for 1+x.","Compute the inverse of a one-parameter Box-Cox transformation.","Compute the absolute value of a double-precision complex floating-point number.","Compute the squared absolute value of a double-precision complex floating-point number.","Compute the squared absolute value of a single-precision complex floating-point number.","Compute the absolute value of a single-precision complex floating-point number.","Compute the cube root of a double-precision floating-point number.","Compute the cube root of a single-precision floating-point number.","Round a double-precision complex floating-point number toward positive infinity.","Round a single-precision complex floating-point number toward positive infinity.","Round a complex number to the nearest multiple of 10^n toward positive infinity.","Compute the cis function of a complex number.","Round a double-precision floating-point number toward positive infinity.","Round a numeric value to the nearest power of 10 toward positive infinity.","Round a numeric value to the nearest power of two toward positive infinity.","Round a numeric value to the nearest multiple of b^n toward positive infinity.","Round a single-precision floating-point number toward positive infinity.","Round a numeric value to the nearest multiple of 10^n toward positive infinity.","Round a numeric value to the nearest number toward positive infinity with N significant figures.","Compute the exponential function of a complex number.","Return a double-precision complex floating-point number with the same magnitude as z and the sign of y*z.","Return a single-precision complex floating-point number with the same magnitude as z and the sign of y*z.","Round a complex number toward negative infinity.","Round a complex number to the nearest multiple of 10^n toward negative infinity.","Evaluate the identity function for a double-precision complex floating-point number.","Evaluate the identity function for a single-precision complex floating-point number.","Compute the inverse of a complex number.","Restrict a double-precision floating-point number to a specified range.","Restrict a single-precision floating-point number to a specified range.","Return a double-precision floating-point number with the magnitude of x and the sign of y.","Return a single-precision floating-point number with the magnitude of x and the sign of y.","Compute the cosine of a number.","Compute the hyperbolic cosine of a number.","Compute the cosine of a number minus one.","Compute cos(πx).","Evaluate the cotangent of a number.","Compute the hyperbolic cotangent of a number.","Compute the coversed cosine.","Compute the coversed sine.","Compute the argument of a complex number in radians.","Compute the absolute value and the phase of a complex number.","Round a complex number to the nearest integer.","Round a complex number to the nearest multiple of 10^n.","Compute the hyperbolic cosecant of a number.","Evaluate the signum function of a complex number.","Convert an angle from degrees to radians.","Convert an angle from degrees to radians (single-precision).","Digamma function.","Evaluate the Dirac delta function.","Dirichlet eta function.","Compute the complete elliptic integral of the second kind.","Compute the complete elliptic integral of the first kind.","Error function.","Complementary error function.","Inverse complementary error function.","Inverse error function.","Natural exponential function.","Base 10 exponential function.","Base 2 exponential function.","Standard logistic function.","Compute exp(x) - 1.","Relative error exponential.","Evaluate a factorial.","Evaluate the natural logarithm of the factorial function.","Compute the falling factorial.","Fast math special functions.","Compute an absolute value.","Compute the hyperbolic arccosine of a number.","Compute the hypotenuse using the alpha max plus beta min algorithm.","Compute the hyperbolic arcsine of a number.","Compute the hyperbolic arctangent of a number.","Compute the hypotenuse.","Return the maximum value.","Return the minimum value.","Exponential function.","Compute an integer binary logarithm (base two).","Compute an integer square root.","Compute the nth Fibonacci number.","Compute the Fibonacci number index.","Return a double-precision floating-point number with the magnitude of x and the sign of x*y.","Return a single-precision floating-point number with the magnitude of x and the sign of x*y.","Round a double-precision floating-point number toward negative infinity.","Round a numeric value to the nearest power of 10 toward negative infinity.","Round a numeric value to the nearest power of two toward negative infinity.","Round a numeric value to the nearest multiple of b^n toward negative infinity.","Round a single-precision floating-point numeric value toward negative infinity.","Round a numeric value to the nearest multiple of 10^n toward negative infinity.","Round a numeric value to the nearest number toward negative infinity with N significant figures.","Compute the Fresnel integrals S(x) and C(x).","Compute the Fresnel integral C(x).","Compute the Fresnel integral S(x).","Split a double-precision floating-point number into a normalized fraction and an integer power of two.","Gamma function.","Compute the ratio of two gamma functions.","Calculate the Lanczos sum for the approximation of the gamma function.","Calculate a scaled Lanczos sum for the approximation of the gamma function.","Compute gamma(x+1) - 1.","Incomplete gamma function.","Inverse incomplete gamma function.","Natural logarithm of the gamma function.","Compute the greatest common divisor (gcd).","Compute the half-value coversed cosine.","Compute the half-value coversed sine.","Compute the half-value versed cosine.","Compute the half-value versed sine.","Evaluate the Heaviside function.","Compute the hypotenuse avoiding overflow and underflow.","Compute the hypotenuse avoiding overflow and underflow (single-precision).","Evaluate the identity function for a double-precision floating-point number.","Evaluate the identity function for a single-precision floating-point number.","Compute the multiplicative inverse of a double-precision floating-point number.","Compute the multiplicative inverse of a single-precision floating-point number.","Incomplete beta function and its first derivative.","Inverse incomplete beta function.","Compute the cosine of a number on [-π/4, π/4].","Compute the sine of a number on [-π/4, π/4].","Compute the tangent of a number on [-π/4, π/4].","Evaluate the Kronecker delta.","Evaluate the Kronecker delta (single-precision).","Compute an absolute value of a signed 32-bit integer.","Compute the least common multiple (lcm).","Multiply a double-precision floating-point number by an integer power of two.","Natural logarithm.","Base b logarithm.","Common logarithm (base ten).","Evaluate the natural logarithm of 1-exp(-|x|).","Evaluate the natural logarithm of 1+x.","Evaluate the natural logarithm of 1+exp(x).","Binary logarithm (base 2).","Compute the natural logarithm of exp(x) + exp(y).","Logit function.","Compute the nth Lucas number.","Return the maximum value.","Return the maximum absolute value.","Return the minimum value.","Return the minimum absolute value.","Return the minimum and maximum values.","Return the minimum and maximum absolute values.","Decompose a double-precision floating-point number into integral and fractional parts.","Compute the nth negaFibonacci number.","Compute the nth negaLucas number.","Compute the nth non-Fibonacci number.","Return the positive difference between x and y.","Return the positive difference between x and y.","Polygamma function.","Exponential function.","Evaluate bˣ - 1.","Convert an angle from radians to degrees.","Evaluate the ramp function.","Evaluate the ramp function (single-precision).","Compute x - nπ/2 = r.","Riemann Zeta function.","Compute the rising factorial.","Round a numeric value to the nearest integer.","Round a numeric value to the nearest power of 10 on a linear scale.","Round a numeric value to the nearest power of two on a linear scale.","Round a numeric value to the nearest multiple of b^n on a linear scale.","Round a numeric value to the nearest multiple of 10^n.","Round a numeric value to the nearest number with N significant figures.","Compute the reciprocal square root of a double-precision floating-point number.","Compute the reciprocal square root of a single-precision floating-point number.","Sine and cosine integrals.","Evaluate the signum function for a double-precision floating-point number.","Evaluate the signum function for a single-precision floating-point number.","Compute the sine of a number.","Compute the normalized cardinal sine of a number.","Simultaneously compute the sine and cosine of a number.","Simultaneously compute the sine and cosine of a number times π.","Compute the hyperbolic sine of a number.","Compute sin(πx).","Spence’s function, also known as the dilogarithm.","Compute the principal square root of a double-precision floating-point number.","Compute sqrt(1 + x) - 1.","Compute the principal square root of a single-precision floating-point number.","Evaluate the tangent of a number.","Compute the hyperbolic tangent of a number.","Compute the nth Tribonacci number.","Trigamma function.","Round a double-precision floating-point number toward zero.","Round a numeric value to the nearest power of 10 toward zero.","Round a numeric value to the nearest power of two toward zero.","Round a numeric value to the nearest multiple of b^n toward zero.","Round a single-precision floating-point number toward zero.","Round a numeric value to the nearest multiple of 10^n toward zero.","Round a numeric value to the nearest number toward zero with N significant figures.","Compute the versed cosine.","Compute the versed sine.","Wrap a value on the half-open interval [min,max).","Compute x * ln(y+1) so that the result is 0 if x = 0.","Compute x * ln(y) so that the result is 0 if x = 0.","Base math tools.","Continued fraction approximation.","Evaluate a polynomial.","Compile a module for evaluating a polynomial.","Evaluate a rational function.","Compile a module for evaluating a rational function.","Evaluate a Fibonacci polynomial.","Evaluate a physicist's Hermite polynomial.","Evaluate a Lucas polynomial.","Evaluate a normalized Hermite polynomial.","Compute the sum of an infinite series.","Base math utilities.","Compute the absolute difference of two real numbers.","Compute the relative difference of two real numbers in units of double-precision floating-point epsilon.","Compute the relative difference of two real numbers.","Math iterators.","Math operator iterators.","Create an iterator which performs element-wise addition of two or more iterators.","Create an iterator which performs element-wise division of two or more iterators.","Create an iterator which performs an element-wise modulo operation of two or more iterators.","Create an iterator which performs element-wise multiplication of two or more iterators.","Create an iterator which performs element-wise subtraction of two or more iterators.","Math iterators for generating sequences.","Create an iterator which generates a sequence of composite numbers.","Create an iterator which generates a list of all continued fraction terms which can be obtained given the precision of a provided number.","Create an iterator which generates a sequence of cubes.","Create an iterator which generates an interleaved sequence of even integers.","Create an iterator which generates a sequence of factorials.","Create an iterator which generates a Fibonacci sequence.","Create an iterator which generates a sequence of fifth powers.","Create an iterator which generates a sequence of fourth powers.","Create an iterator which generates an interleaved integer sequence.","Create an iterator which generates a Lucas sequence.","Create an iterator which generates a negaFibonacci sequence.","Create an iterator which generates a negaLucas sequence.","Create an iterator which generates a sequence of negative even integers.","Create an iterator which generates a negative integer sequence.","Create an iterator which generates a sequence of negative odd integers.","Create an iterator which generates a non-Fibonacci integer sequence.","Create an iterator which generates a sequence of nonnegative even integers.","Create an iterator which generates a nonnegative integer sequence.","Create an iterator which generates a sequence of nonpositive even integers.","Create an iterator which generates a nonpositive integer sequence.","Create an iterator which generates a sequence of nonsquares.","Create an iterator which generates an interleaved sequence of odd integers.","Create an iterator which generates a sequence of positive even integers.","Create an iterator which generates a positive integer sequence.","Create an iterator which generates a sequence of positive odd integers.","Create an iterator which generates a sequence of prime numbers.","Create an iterator which generates a sequence of squared triangular numbers.","Create an iterator which generates a sequence of squares.","Create an iterator which generates a sequence of triangular numbers.","Math iterators for special functions.","Create an iterator which computes the absolute value of each iterated value.","Create an iterator which computes the squared absolute value of each iterated value.","Create an iterator which computes the arccosine of each iterated value.","Create an iterator which computes the hyperbolic arccosine of each iterated value.","Create an iterator which computes the inverse cotangent of each iterated value.","Create an iterator which computes the inverse hyperbolic cotangent of each iterated value.","Create an iterator which computes the inverse coversed cosine of each iterated value.","Create an iterator which computes the inverse coversed sine of each iterated value.","Create an iterator which computes the inverse half-value versed cosine of each iterated value.","Create an iterator which computes the inverse half-value versed sine of each iterated value.","Create an iterator which computes the arcsine of each iterated value.","Create an iterator which computes the hyperbolic arcsine of each iterated value.","Create an iterator which computes the arctangent of each iterated value.","Create an iterator which computes the angle in the plane (in radians) between the positive x-axis and the ray from (0,0) to the point (x,y).","Create an iterator which computes the hyperbolic arctangent of each iterated value.","Create an iterator which computes the inverse versed cosine of each iterated value.","Create an iterator which computes the inverse versed sine of each iterated value.","Create an iterator which evaluates the Bessel function of the first kind of order zero for each iterated value.","Create an iterator which evaluates the Bessel function of the first kind of order one for each iterated value.","Create an iterator which evaluates the Bessel function of the second kind of order zero for each iterated value.","Create an iterator which evaluates the Bessel function of the second kind of order one for each iterated value.","Create an iterator which evaluates the beta function.","Create an iterator which evaluates the natural logarithm of the beta function.","Create an iterator which evaluates Binet's formula for each iterated value.","Create an iterator which computes the cube root of each iterated value.","Create an iterator which rounds each iterated value toward positive infinity.","Create an iterator which rounds each iterated value to the nearest power of 10 toward positive infinity.","Create an iterator which rounds each iterated value to the nearest power of two toward positive infinity.","Create an iterator which computes the cosine of each iterated value.","Create an iterator which computes the hyperbolic cosine for each iterated value.","Create an iterator which computes cos(x) - 1 for each iterated value.","Create an iterator which computes the cosine of each iterated value times π.","Create an iterator which computes the coversed cosine for each iterated value.","Create an iterator which computes the coversed sine for each iterated value.","Create an iterator which converts an angle from degrees to radians for each iterated value.","Create an iterator which evaluates the digamma function for each iterated value.","Create an iterator which evaluates the Dirac delta function for each iterated value.","Create an iterator which evaluates the Dirichlet eta function for each iterated value.","Create an iterator which computes the complete elliptic integral of the second kind for each iterated value.","Create an iterator which computes the complete elliptic integral of the first kind for each iterated value.","Create an iterator which evaluates the error function for each iterated value.","Create an iterator which evaluates the complementary error function for each iterated value.","Create an iterator which evaluates the inverse complementary error function for each iterated value.","Create an iterator which evaluates the inverse error function for each iterated value.","Create an iterator which evaluates the natural exponential function for each iterated value.","Create an iterator which evaluates the base 10 exponential function for each iterated value.","Create an iterator which evaluates the base 2 exponential function for each iterated value.","Create an iterator which evaluates the standard logistic function for each iterated value.","Create an iterator which computes exp(x) - 1 for each iterated value.","Create an iterator which evaluates the relative error exponential for each iterated value.","Create an iterator which evaluates the factorial function for each iterated value.","Create an iterator which evaluates the natural logarithm of the factorial function for each iterated value.","Create an iterator which rounds each iterated value toward negative infinity.","Create an iterator which rounds each iterated value to the nearest power of 10 toward negative infinity.","Create an iterator which rounds each iterated value to the nearest power of two toward negative infinity.","Create an iterator which computes the Fresnel integral C(x) for each iterated value.","Create an iterator which computes the Fresnel integral S(x) for each iterated value.","Create an iterator which evaluates the gamma function for each iterated value.","Create an iterator which computes gamma(x+1) - 1 for each iterated value.","Create an iterator which evaluates the natural logarithm of the gamma function for each iterated value.","Create an iterator which computes the half-value coversed cosine for each iterated value.","Create an iterator which computes the half-value coversed sine for each iterated value.","Create an iterator which computes the half-value versed cosine for each iterated value.","Create an iterator which computes the half-value versed sine for each iterated value.","Create an iterator which computes the multiplicative inverse of each iterated value.","Create an iterator which evaluates the natural logarithm for each iterated value.","Create an iterator which computes the base b logarithm.","Create an iterator which evaluates the common logarithm (logarithm with base 10) for each iterated value.","Create an iterator which evaluates the natural logarithm of 1-exp(-|x|) for each iterated value.","Create an iterator which evaluates the natural logarithm of 1+x for each iterated value.","Create an iterator which evaluates the natural logarithm of 1+exp(x) for each iterated value.","Create an iterator which evaluates the binary logarithm for each iterated value.","Create an iterator which evaluates the logit function for each iterated value.","Create an iterator which evaluates the exponential function.","Create an iterator which converts an angle from radians to degrees for each iterated value.","Create an iterator which evaluates the ramp function for each iterated value.","Create an iterator which evaluates the Riemann zeta function for each iterated value.","Create an iterator which rounds each iterated value to the nearest integer.","Create an iterator which rounds each iterated value to the nearest power of 10 on a linear scale.","Create an iterator which rounds each iterated value to the nearest power of two on a linear scale.","Create an iterator which computes the reciprocal (inverse) square root of each iterated value.","Create an iterator which evaluates the signum function for each iterated value.","Create an iterator which computes the sine of each iterated value.","Create an iterator which computes the normalized cardinal sine for each iterated value.","Create an iterator which evaluates the hyperbolic sine for each iterated value.","Create an iterator which computes the sine of each iterated value times π.","Create an iterator which evaluates Spence's function for each iterated value.","Create an iterator which computes the principal square root of each iterated value.","Create an iterator which computes sqrt(1+x) - 1 for each iterated value.","Create an iterator which evaluates the tangent for each iterated value.","Create an iterator which evaluates the hyperbolic tangent for each iterated value.","Create an iterator which evaluates the trigamma function for each iterated value.","Create an iterator which rounds each iterated value toward zero.","Create an iterator which rounds each iterated value to the nearest power of 10 toward zero.","Create an iterator which rounds each iterated value to the nearest power of two toward zero.","Create an iterator which computes the versed cosine for each iterated value.","Create an iterator which computes the versed sine for each iterated value.","Math iterator tooling.","Create an iterator which invokes a unary function accepting a single numeric argument for each iterated value.","Create an iterator which invokes a binary function accepting numeric arguments for each iterated value.","Create an iterator which invokes a ternary function accepting numeric arguments for each iterated value.","Math utility iterators.","Evaluate the terms of a continued fraction.","Special math functions.","Compute the absolute value.","Strided array math functions.","Strided array math operations.","Element-wise addition of two strided arrays.","Element-wise multiplication of two strided arrays.","Element-wise subtraction of two strided arrays.","Strided array special math functions.","Compute the absolute value for each element in a strided array.","Compute the absolute value of each element retrieved from a strided input array via a callback function and assign each result to an element in a strided output array.","Compute the squared absolute value for each element in a strided array.","Compute the squared absolute value of each element retrieved from an input strided array via a callback function.","Compute the arccosine of each element retrieved from an input strided array via a callback function.","Compute the hyperbolic arccosine of each element retrieved from an input strided array via a callback function.","Compute the inverse cotangent of each element retrieved from an input strided array via a callback function.","Compute the inverse hyperbolic cotangent of each element retrieved from an input strided array via a callback function.","Compute the inverse coversed cosine of each element retrieved from an input strided array via a callback function.","Compute the inverse coversed sine of each element retrieved from an input strided array via a callback function.","Compute the inverse half-value versed cosine of each element retrieved from an input strided array via a callback function.","Compute the inverse half-value versed sine of each element retrieved from an input strided array via a callback function.","Compute the arcsine of each element retrieved from an input strided array via a callback function.","Compute the hyperbolic arcsine of each element retrieved from an input strided array via a callback function.","Compute the arctangent of each element retrieved from an input strided array via a callback function.","Compute the hyperbolic arctangent of each element retrieved from an input strided array via a callback function.","Compute the inverse versed cosine of each element retrieved from an input strided array via a callback function.","Compute the inverse versed sine of each element retrieved from an input strided array via a callback function.","Compute the Bessel function of the first kind of order zero for each element retrieved from an input strided array via a callback function.","Compute the Bessel function of the first kind of order one for each element retrieved from an input strided array via a callback function.","Compute the Bessel function of the second kind of order zero for each element retrieved from an input strided array via a callback function.","Compute the Bessel function of the second kind of order one for each element retrieved from an input strided array via a callback function.","Evaluate Binet's formula extended to real numbers for each element retrieved from an input strided array via a callback function.","Compute the cube root of each element in a strided array.","Round each element in a strided array toward positive infinity.","Compute the absolute value for each element in a double-precision floating-point strided array.","Compute the squared absolute value for each element in a double-precision floating-point strided array.","Compute the cube root of each element in a double-precision floating-point strided array.","Round each element in a double-precision floating-point strided array toward positive infinity.","Convert each element in a double-precision floating-point strided array from degrees to radians.","Convert each element in a strided array from degrees to radians.","Round each element in a double-precision floating-point strided array toward negative infinity.","Compute the multiplicative inverse for each element in a double-precision floating-point strided array.","Compute the absolute value for each element in a double-precision floating-point strided array according to a strided mask array.","Compute the squared absolute value for each element in a double-precision floating-point strided array according to a strided mask array.","Compute the cube root for each element in a double-precision floating-point strided array according to a strided mask array.","Round each element in a double-precision floating-point strided array toward positive infinity according to a strided mask array.","Convert each element in a double-precision floating-point strided array from degrees to radians according to a strided mask array.","Round each element in a double-precision floating-point strided array toward negative infinity according to a strided mask array.","Compute the multiplicative inverse for each element in a double-precision floating-point strided array according to a strided mask array.","Evaluate the ramp function for each element in a double-precision floating-point strided array according to a strided mask array.","Compute the reciprocal square root for each element in a double-precision floating-point strided array according to a strided mask array.","Compute the principal square root for each element in a double-precision floating-point strided array according to a strided mask array.","Round each element in a double-precision floating-point strided array toward zero according to a strided mask array.","Evaluate the ramp function for each element in a double-precision floating-point strided array.","Compute the reciprocal square root for each element in a double-precision floating-point strided array.","Compute the principal square root for each element in a double-precision floating-point strided array.","Round each element in a double-precision floating-point strided array toward zero.","Round each element in a strided array toward negative infinity.","Compute the multiplicative inverse for each element in a strided array.","Evaluate the ramp function for each element in a strided array.","Compute the reciprocal square root for each element in a strided array.","Compute the absolute value for each element in a single-precision floating-point strided array.","Compute the squared absolute value for each element in a single-precision floating-point strided array.","Compute the cube root of each element in a single-precision floating-point strided array.","Round each element in a single-precision floating-point strided array toward positive infinity.","Convert each element in a single-precision floating-point strided array from degrees to radians.","Round each element in a single-precision floating-point strided array toward negative infinity.","Compute the multiplicative inverse for each element in a single-precision floating-point strided array.","Compute the absolute value for each element in a single-precision floating-point strided array according to a strided mask array.","Compute the squared absolute value for each element in a single-precision floating-point strided array according to a strided mask array.","Compute the cube root for each element in a single-precision floating-point strided array according to a strided mask array.","Round each element in a single-precision floating-point strided array toward positive infinity according to a strided mask array.","Convert each element in a single-precision floating-point strided array from degrees to radians according to a strided mask array.","Round each element in a single-precision floating-point strided array toward negative infinity according to a strided mask array.","Compute the multiplicative inverse for each element in a single-precision floating-point strided array according to a strided mask array.","Evaluate the ramp function for each element in a single-precision floating-point strided array according to a strided mask array.","Compute the reciprocal square root for each element in a single-precision floating-point strided array according to a strided mask array.","Compute the principal square root for each element in a single-precision floating-point strided array according to a strided mask array.","Round each element in a single-precision floating-point strided array toward zero according to a strided mask array.","Compute the principal square root for each element in a strided array.","Evaluate the ramp function for each element in a single-precision floating-point strided array.","Compute the reciprocal square root for each element in a single-precision floating-point strided array.","Compute the principal square root for each element in a single-precision floating-point strided array.","Round each element in a single-precision floating-point strided array toward zero.","Round each element in a strided array toward zero.","Math tools.","Multiple dispatch for unary mathematical functions.","Machine learning algorithms.","Incremental machine learning algorithms.","Incrementally perform binary classification using stochastic gradient descent (SGD).","Incrementally partition data into k clusters.","Online regression via stochastic gradient descent (SGD).","The standard library namespace.","Return the package name associated with a specified alias.","Return aliases related to a specified alias.","Return the standalone package name associated with a specified alias.","Standard library aliases.","Return the alias associated with a specified package name.","Return package names related to a specified package name.","Return the standalone package name associated with a provided internal package name.","Return the internal package name associated with a provided standalone package name.","Multidimensional arrays.","Multidimensional arrays.","Base ndarray.","Base ndarray assertion utilities.","Determine if an ndarray data type can be cast to another ndarray data type according to a specified casting mode.","Determine if a buffer length is compatible with provided ndarray meta data.","Determine if a buffer length is compatible with a provided shape array.","Test if an input value is a supported ndarray casting mode.","Given a stride array, determine whether an array is column-major.","Determine if an array is column-major contiguous.","Determine if an array is contiguous.","Test if an input value is a supported ndarray data type.","Test if an input value is a supported ndarray index mode.","Test if an input value is an ndarray order.","Test if an ndarray is read-only.","Given a stride array, determine whether an array is row-major.","Determine if an array is row-major contiguous.","Determine if an ndarray data type can be safely cast to another ndarray data type.","Determine if an ndarray data type can be safely cast to, or is of the same kind as, another ndarray data type.","Determine if an array is compatible with a single memory segment.","Convert a linear index in an underlying data buffer to a linear index in an array view.","Broadcast an ndarray to a specified shape.","Broadcast array shapes to a single shape.","Create a zero-filled contiguous linear ndarray data buffer.","ndarray data buffer constructors.","Return the data type of an ndarray data buffer.","Return the data type enumeration constant of an ndarray data buffer.","Return the number of bytes per element provided an underlying array data type.","Return the data type string associated with a provided single letter abbreviation.","Restrict an index to the interval [0,max].","Base multidimensional array.","Return the single letter character abbreviation for an underlying array data type.","Return the description for a provided data type.","Return the data type string associated with an ndarray data type enumeration constant.","Return the enumeration constant associated with a supported ndarray data type value.","Return the data type string associated with a supported ndarray data type value.","Return the enumeration constant associated with an ndarray data type string.","Return the C data type associated with a provided data type value.","Transform a list of array argument data types into a list of signatures.","Expand the shape of an array by inserting a new dimension of size one at a specified axis.","Convert a scalar value to a zero-dimensional ndarray.","C APIs for creating and managing ndarray function objects.","Return an index given an index mode.","Convert a linear index to an array of subscripts.","Given a stride array, determine array iteration order.","Compute the maximum linear index in an underlying data buffer accessible to an array view.","Broadcast an ndarray to a specified shape if and only if the specified shape differs from the provided ndarray's shape.","Define non-enumerable read-only properties which expose ndarray function meta data.","Compute the minimum linear index in an underlying data buffer accessible to an array view.","Compute the minimum and maximum linear indices in an underlying data buffer which are accessible to an array view.","C APIs for creating Node-API ndarray native add-ons.","C API for validating, extracting, and transforming (to native C types) function arguments provided to an ndarray Node-API add-on interface.","C API for returning the ndarray data type corresponding to a data type string.","C API for returning the ndarray data type corresponding to a Node-API typed array type.","C API for registering a Node-API module exporting an ndarray interface for applying a unary callback to an input ndarray.","Convert an ndarray-like object to an object likely to have the same \"shape\".","Return the number of non-singleton dimensions.","Return the number of elements in an array.","Prepend singleton dimensions.","Remove singleton dimensions.","Serialize ndarray meta data.","Generate a stride array from an array shape.","Return the number of singleton dimensions.","Determine the index offset which specifies the location of the first indexed value in a multidimensional array based on a stride array.","Determine the order of a multidimensional array based on a provided stride array.","Convert subscripts to a linear index.","Convert an ndarray buffer to a generic array.","Transpose a matrix (or a stack of matrices).","Apply a unary callback to elements in a input ndarray and assign results to elements in an output ndarray.","Convert a linear index in an array view to a linear index in an underlying data buffer.","Wrap an index on the interval [0,max].","Create a zero-filled ndarray having a specified shape and data type.","Create a zero-filled ndarray having the same shape and data type as a provided ndarray.","List of ndarray casting modes.","Multidimensional array constructor.","Create an ndarray function interface which performs multiple dispatch.","List of ndarray data types.","Convert a scalar value to a zero-dimensional ndarray.","Convert a linear index to an array of subscripts.","List of ndarray index modes.","Determine the minimum ndarray data type of the closest kind necessary for storing a provided scalar value.","Return the next larger ndarray data type of the same kind.","List of ndarray orders.","Return the ndarray data type with the smallest size and closest kind to which ndarray data types can be safely cast.","Return a list of ndarray data types to which a provided ndarray data type can be safely cast.","Return a list of ndarray data types to which a provided ndarray data type can be safely cast or cast within the same kind.","Convert subscripts to a linear index.","Create a zero-filled ndarray having a specified shape and data type.","Create a zero-filled ndarray having the same shape and data type as a provided ndarray.","Networking.","Disposable HTTP server.","HTTP server.","Simple HTTP server.","Natural language processing.","Expand contractions.","Latent Dirichlet Allocation via collapsed Gibbs sampling.","Extract the stem of a given word.","Tokenize a string.","Number.","Number constructor.","Utilities for single-precision floating-point numbers.","Base utilities for single-precision floating-point numbers.","Return an integer corresponding to the unbiased exponent of a single-precision floating-point number.","Create a single-precision floating-point number from a literal bit representation.","Create a single-precision floating-point number from an unsigned integer corresponding to an IEEE 754 binary representation.","Return a normal number y and exponent exp satisfying x = y * 2^exp.","Return a boolean indicating if the sign bit for a single-precision floating-point number is on (true) or off (false).","Return an integer corresponding to the significand of a single-precision floating-point number.","Return a string giving the literal bit representation of a single-precision floating-point number.","Convert a single-precision floating-point number to a signed 32-bit integer.","Convert a single-precision floating-point number to an unsigned 32-bit integer.","Return an unsigned 32-bit integer corresponding to the IEEE 754 binary representation of a single-precision floating-point number.","Utilities for double-precision floating-point numbers.","Base utilities for double-precision floating-point numbers.","Return an integer corresponding to the unbiased exponent of a double-precision floating-point number.","Create a double-precision floating-point number from a literal bit representation.","Convert a signed 64-bit integer byte array to a double-precision floating-point number.","Create a double-precision floating-point number from a higher order word and a lower order word.","Return an unsigned 32-bit integer corresponding to the more significant 32 bits of a double-precision floating-point number.","Return an unsigned 32-bit integer corresponding to the less significant 32 bits of a double-precision floating-point number.","Return a normal number y and exponent exp satisfying x = y * 2^exp.","Set the more significant 32 bits of a double-precision floating-point number.","Set the less significant 32 bits of a double-precision floating-point number.","Return a boolean indicating if the sign bit for a double-precision floating-point number is on (true) or off (false).","Return a string giving the literal bit representation of a double-precision floating-point number.","Convert a double-precision floating-point number to the nearest single-precision floating-point number.","Convert a double-precision floating-point number to a signed 32-bit integer.","Convert an integer-valued double-precision floating-point number to a signed 64-bit integer byte array according to host byte order.","Convert a double-precision floating-point number to an unsigned 32-bit integer.","Split a double-precision floating-point number into a higher order word and a lower order word.","Utilities for signed 32-bit integers.","Base utilities for signed 32-bit integers.","Convert a signed 32-bit integer to an unsigned 32-bit integer.","Utilities for unsigned 16-bit integers.","Base utilities for unsigned 16-bit integers.","Create an unsigned 16-bit integer from a literal bit representation.","Return a string giving the literal bit representation of an unsigned 16-bit integer.","Utilities for unsigned 32-bit integers.","Base utilities for unsigned 32-bit integers.","Create an unsigned 32-bit integer from a literal bit representation.","Bitwise rotation to the left.","Bitwise rotation to the right.","Return a string giving the literal bit representation of an unsigned 32-bit integer.","Convert an unsigned 32-bit integer to a signed 32-bit integer.","Utilities for unsigned 8-bit integers.","Base utilities for unsigned 8-bit integers.","Create an unsigned 8-bit integer from a literal bit representation.","Return a string giving the literal bit representation of an unsigned 8-bit integer.","OS utilities.","Operating system CPU architecture.","Platform byte order.","Return a directory for user-specific configuration files.","Platform float word order.","Return the current user's home directory.","Number of CPUs.","Platform on which the current process is running.","Return the directory for storing temporary files.","Plotting.",null,"Base 2-dimensional plot constructor.",null,null,"SVG plot annotations.","Axis.","SVG background.","SVG canvas.","SVG clipping path.","SVG plot definitions.","Graph component.","Marks.","SVG path.","SVG rug component.","SVG symbols.","SVG title.","2-dimensional plot constructor.","Sparklines.","Base (i.e., lower-level) sparkline functionality.","Base class for sparklines.","Create a Unicode sparkline.","Create a Unicode sparkline column chart.","Create a Unicode sparkline line chart.","Create a Unicode sparkline tristate chart.","Create a Unicode sparkline up/down chart.","Create a Unicode sparkline win/loss chart.",null,"Create a Unicode stem-and-leaf chart.","Process utilities.","Array containing command-line arguments passed when launching the calling process.","Change the current working directory.","Return the current working directory.","Object containing the user environment.","Absolute pathname of the executable which started the current Node.js process.","Return the effective numeric group identity of a calling process.","Return the effective numeric user identity of a calling process.","Return the numeric group identity of a calling process.","Return the numeric user identity of a calling process.","Node version.","Read data from stdin.","Get/set the process mask.","Proxy.","Proxy object.","Random numbers.","Base pseudorandom number generators.","Arcsine distributed pseudorandom numbers.","Bernoulli distributed pseudorandom numbers.","Beta distributed pseudorandom numbers.","Beta prime distributed pseudorandom numbers.","Binomial distributed pseudorandom numbers.","Normally distributed pseudorandom numbers using the Box-Muller transform.","Cauchy distributed pseudorandom numbers.","Chi distributed pseudorandom numbers.","Chi-square distributed pseudorandom numbers.","Raised cosine distributed pseudorandom numbers.","Discrete uniform distributed pseudorandom numbers.","Erlang distributed pseudorandom numbers.","Exponentially distributed pseudorandom numbers.","F distributed pseudorandom numbers.","Fréchet distributed pseudorandom numbers.","Gamma distributed pseudorandom numbers.","Geometric distributed pseudorandom numbers.","Gumbel distributed pseudorandom numbers.","Hypergeometric distributed pseudorandom numbers.","Normally distributed pseudorandom numbers using the improved Ziggurat method.","Inverse gamma distributed pseudorandom numbers.","Kumaraswamy's double bounded distributed pseudorandom numbers.","Laplace (double exponential) distributed pseudorandom numbers.","Lévy distributed pseudorandom numbers.","Logistic distributed pseudorandom numbers.","Log-normally distributed pseudorandom numbers.","A linear congruential pseudorandom number generator (LCG) based on Park and Miller.","A linear congruential pseudorandom number generator (LCG) whose output is shuffled.","A 32-bit Mersenne Twister pseudorandom number generator.","Negative binomial distributed pseudorandom numbers.","Normally distributed pseudorandom numbers.","Pareto (Type I) distributed pseudorandom numbers.","Poisson distributed random numbers.","Pseudorandom numbers having integer values.","Standard normal pseudorandom numbers.","Uniformly distributed pseudorandom numbers between 0 and 1.","Rayleigh distributed pseudorandom numbers.","Revive a JSON-serialized pseudorandom number generator (PRNG).","Student's t-distributed pseudorandom numbers.","Triangular distributed pseudorandom numbers.","Uniformly distributed pseudorandom numbers.","Weibull distributed pseudorandom numbers.","Pseudorandom number generator iterators.","Create an iterator for generating pseudorandom numbers drawn from an arcsine distribution.","Create an iterator for generating pseudorandom numbers drawn from a Bernoulli distribution.","Create an iterator for generating pseudorandom numbers drawn from a beta distribution.","Create an iterator for generating pseudorandom numbers drawn from a beta prime distribution.","Create an iterator for generating pseudorandom numbers drawn from a binomial distribution.","Create an iterator for generating pseudorandom numbers drawn from a standard normal distribution using the Box-Muller transform.","Create an iterator for generating pseudorandom numbers drawn from a Cauchy distribution.","Create an iterator for generating pseudorandom numbers drawn from a chi distribution.","Create an iterator for generating pseudorandom numbers drawn from a chi-square distribution.","Create an iterator for generating pseudorandom numbers drawn from a raised cosine distribution.","Create an iterator for generating pseudorandom numbers drawn from a discrete uniform distribution.","Create an iterator for generating pseudorandom numbers drawn from an Erlang distribution.","Create an iterator for generating pseudorandom numbers drawn from an exponential distribution.","Create an iterator for generating pseudorandom numbers drawn from an F distribution.","Create an iterator for generating pseudorandom numbers drawn from a Fréchet distribution.","Create an iterator for generating pseudorandom numbers drawn from a gamma distribution.","Create an iterator for generating pseudorandom numbers drawn from a geometric distribution.","Create an iterator for generating pseudorandom numbers drawn from a Gumbel distribution.","Create an iterator for generating pseudorandom numbers drawn from a hypergeometric distribution.","Create an iterator for generating pseudorandom numbers drawn from a standard normal distribution using the Improved Ziggurat algorithm.","Create an iterator for generating pseudorandom numbers drawn from an inverse gamma distribution.","Create an iterator for generating pseudorandom numbers drawn from a Kumaraswamy's double bounded distribution.","Create an iterator for generating pseudorandom numbers drawn from a Laplace distribution.","Create an iterator for generating pseudorandom numbers drawn from a Lévy distribution.","Create an iterator for generating pseudorandom numbers drawn from a logistic distribution.","Create an iterator for generating pseudorandom numbers drawn from a lognormal distribution.","Create an iterator for a linear congruential pseudorandom number generator (LCG) based on Park and Miller.","Create an iterator for a linear congruential pseudorandom number generator (LCG) whose output is shuffled.","Create an iterator for a 32-bit Mersenne Twister pseudorandom number generator.","Create an iterator for generating pseudorandom numbers drawn from a negative binomial distribution.","Create an iterator for generating pseudorandom numbers drawn from a normal distribution.","Create an iterator for generating pseudorandom numbers drawn from a Pareto (Type I) distribution.","Create an iterator for generating pseudorandom numbers drawn from a Poisson distribution.","Create an iterator for generating pseudorandom numbers having integer values.","Create an iterator for generating pseudorandom numbers drawn from a standard normal distribution.","Create an iterator for generating uniformly distributed pseudorandom numbers between 0 and 1.","Create an iterator for generating pseudorandom numbers drawn from a Rayleigh distribution.","Create an iterator for generating pseudorandom numbers drawn from a Student's t distribution.","Create an iterator for generating pseudorandom numbers drawn from a triangular distribution.","Create an iterator for generating pseudorandom numbers drawn from a continuous uniform distribution.","Create an iterator for generating pseudorandom numbers drawn from a Weibull distribution.","Sample elements from an array-like object.","Shuffle elements of an array-like object.","Pseudorandom number generator streams.","Create a readable stream for generating pseudorandom numbers drawn from an arcsine distribution.","Create a readable stream for generating pseudorandom numbers drawn from a Bernoulli distribution.","Create a readable stream for generating pseudorandom numbers drawn from a beta distribution.","Create a readable stream for generating pseudorandom numbers drawn from a beta prime distribution.","Create a readable stream for generating pseudorandom numbers drawn from a binomial distribution.","Create a readable stream for generating pseudorandom numbers drawn from a standard normal distribution using the Box-Muller transform.","Create a readable stream for generating pseudorandom numbers drawn from a Cauchy distribution.","Create a readable stream for generating pseudorandom numbers drawn from a chi distribution.","Create a readable stream for generating pseudorandom numbers drawn from a chi-square distribution.","Create a readable stream for generating pseudorandom numbers drawn from a raised cosine distribution.","Create a readable stream for generating pseudorandom numbers drawn from a discrete uniform distribution.","Create a readable stream for generating pseudorandom numbers drawn from an Erlang distribution.","Create a readable stream for generating pseudorandom numbers drawn from an exponential distribution.","Create a readable stream for generating pseudorandom numbers drawn from an F distribution.","Create a readable stream for generating pseudorandom numbers drawn from a Fréchet distribution.","Create a readable stream for generating pseudorandom numbers drawn from a gamma distribution.","Create a readable stream for generating pseudorandom numbers drawn from a geometric distribution.","Create a readable stream for generating pseudorandom numbers drawn from a Gumbel distribution.","Create a readable stream for generating pseudorandom numbers drawn from a hypergeometric distribution.","Create a readable stream for generating pseudorandom numbers drawn from a standard normal distribution using the Improved Ziggurat algorithm.","Create a readable stream for generating pseudorandom numbers drawn from an inverse gamma distribution.","Create a readable stream for generating pseudorandom numbers drawn from a Kumaraswamy's double bounded distribution.","Create a readable stream for generating pseudorandom numbers drawn from a Laplace (double exponential) distribution.","Create a readable stream for generating pseudorandom numbers drawn from a Lévy distribution.","Create a readable stream for generating pseudorandom numbers drawn from a logistic distribution.","Create a readable stream for generating pseudorandom numbers drawn from a lognormal distribution.","Create a readable stream for a linear congruential pseudorandom number generator (LCG) based on Park and Miller.","Create a readable stream for a linear congruential pseudorandom number generator (LCG) whose output is shuffled.","Create a readable stream for a 32-bit Mersenne Twister pseudorandom number generator.","Create a readable stream for generating pseudorandom numbers drawn from a negative binomial distribution.","Create a readable stream for generating pseudorandom numbers drawn from a normal distribution.","Create a readable stream for generating pseudorandom numbers drawn from a Pareto (Type I) distribution.","Create a readable stream for generating pseudorandom numbers drawn from a Poisson distribution.","Create a readable stream for generating pseudorandom numbers having integer values.","Create a readable stream for generating pseudorandom numbers drawn from a standard normal distribution.","Create a readable stream for generating uniformly distributed pseudorandom numbers between 0 and 1.","Create a readable stream for generating pseudorandom numbers drawn from a Rayleigh distribution.","Create a readable stream for generating pseudorandom numbers drawn from a Student's t distribution.","Create a readable stream for generating pseudorandom numbers drawn from a triangular distribution.","Create a readable stream for generating pseudorandom numbers drawn from a uniform distribution.","Create a readable stream for generating pseudorandom numbers drawn from a Weibull distribution.","Regular expressions.","Return a regular expression to capture the last part of a path.","Return a regular expression to capture the last part of a POSIX path.","Return a regular expression to capture the last part of a Windows path.","Return a regular expression to match a hexadecimal color.","Return a regular expression to match a decimal number.","Return a regular expression to capture a path dirname.","Return a regular expression to capture a POSIX path dirname.","Return a regular expression to capture a Windows path dirname.","Return a regular expression to match a newline character sequence.","Regular expression to detect an extended-length path.","Return a regular expression to capture a filename extension.","Return a regular expression to capture a POSIX filename extension.","Return a regular expression to capture a Windows filename extension.","Return a regular expression to split a filename.","Return a regular expression to split a POSIX filename.","Return a regular expression to split a Windows filename.","Return a regular expression to capture a function name.","Return a regular expression to match a native function.","Return a regular expression to parse a regular expression string.","Return a regular expression to parse a UNC path.","Return a regular expression to match a UTF-16 surrogate pair.","Return a regular expression to match an unpaired UTF-16 surrogate.","Return a regular expression to match a white space character.","REPL environment.","Return an example associated with a provided alias.","Return help text associated with a provided alias.","Return abbreviated help text associated with a provided alias.","REPL presentation.","REPL environment.","Return the signature(s) associated with a provided alias.","Return the typed signature(s) associated with a provided alias.","Simulation utilities.","Simulation iterators.","Create an iterator which introduces additive white Gaussian noise.","Create an iterator which introduces additive white Laplacian noise.","Create an iterator which introduces additive white uniform noise.","Create an iterator which generates a Bartlett-Hann pulse waveform.","Create an iterator which generates a Bartlett pulse waveform.","Create an iterator which generates a cosine wave.","Create an iterator which generates a Dirac comb.","Create an iterator which generates a flat top pulse waveform.","Create an iterator which generates a Hann pulse waveform.","Create an iterator which generates a Lanczos pulse waveform.","Create an iterator which generates a periodic sinc waveform.","Create an iterator which generates a pulse waveform.","Create an iterator which generates a sawtooth wave.","Create an iterator which generates a sine wave.","Create an iterator which generates a square wave.","Create an iterator which generates a triangle wave.","Standard library statistical functions.","Perform a one-way analysis of variance.","Bartlett’s test for equal variances.","Base (i.e., lower-level) statistical functions.","Calculate the cumulative maximum of a strided array.","Calculate the cumulative maximum absolute value of a strided array.","Calculate the cumulative minimum of a strided array.","Calculate the cumulative minimum absolute value of a strided array.","Calculate the cumulative maximum of double-precision floating-point strided array elements.","Calculate the cumulative maximum absolute value of double-precision floating-point strided array elements.","Calculate the cumulative minimum of double-precision floating-point strided array elements.","Calculate the cumulative minimum absolute value of double-precision floating-point strided array elements.","Base (i.e., lower-level) probability distributions.","Arcsine distribution.","Arcsine distribution cumulative distribution function (CDF).","Arcsine distribution constructor.","Arcsine distribution differential entropy.","Arcsine distribution excess kurtosis.","Arcsine distribution logarithm of cumulative distribution function (CDF).","Arcsine distribution logarithm of probability density function (PDF).","Arcsine distribution expected value.","Arcsine distribution median.","Arcsine distribution mode.","Arcsine distribution probability density function (PDF).","Arcsine distribution quantile function.","Arcsine distribution skewness.","Arcsine distribution standard deviation.","Arcsine distribution variance.","Bernoulli distribution.","Bernoulli distribution cumulative distribution function (CDF).","Bernoulli distribution constructor.","Bernoulli distribution entropy.","Bernoulli distribution excess kurtosis.","Bernoulli distribution expected value.","Bernoulli distribution median.","Bernoulli distribution moment-generating function (MGF).","Bernoulli distribution mode.","Bernoulli distribution probability mass function (PMF).","Bernoulli distribution quantile function.","Bernoulli distribution skewness.","Bernoulli distribution standard deviation.","Bernoulli distribution variance.","Beta distribution.","Beta distribution cumulative distribution function (CDF).","Beta distribution constructor.","Beta distribution differential entropy.","Beta distribution excess kurtosis.","Beta distribution logarithm of cumulative distribution function (CDF).","Beta distribution logarithm of probability density function (PDF).","Beta distribution expected value.","Beta distribution median.","Beta distribution moment-generating function (MGF).","Beta distribution mode.","Beta distribution probability density function (PDF).","Beta distribution quantile function.","Beta distribution skewness.","Beta distribution standard deviation.","Beta distribution variance.","Beta prime distribution.","Beta prime distribution cumulative distribution function (CDF).","Beta prime distribution constructor.","Beta prime distribution excess kurtosis.","Evaluate the natural logarithm of the cumulative distribution function (CDF) for a beta prime distribution.","Beta prime distribution logarithm of probability density function (PDF).","Beta prime distribution expected value.","Beta prime distribution mode.","Beta prime distribution probability density function (PDF).","Beta prime distribution quantile function.","Beta prime distribution skewness.","Beta prime distribution standard deviation.","Beta prime distribution variance.","Binomial distribution.","Binomial distribution cumulative distribution function (CDF).","Binomial distribution constructor.","Binomial distribution entropy.","Binomial distribution excess kurtosis.","Natural logarithm of the probability mass function (PMF) for a binomial distribution.","Binomial distribution expected value.","Binomial distribution median.","Binomial distribution moment-generating function (MGF).","Binomial distribution mode.","Binomial distribution probability mass function (PMF).","Binomial distribution quantile function.","Binomial distribution skewness.","Binomial distribution standard deviation.","Binomial distribution variance.","Cauchy distribution.","Cauchy distribution cumulative distribution function (CDF).","Cauchy distribution constructor.","Cauchy distribution differential entropy.","Cauchy distribution natural logarithm of cumulative distribution function (CDF).","Cauchy distribution logarithm of probability density function (logPDF).","Cauchy distribution median.","Cauchy distribution mode.","Cauchy distribution probability density function (PDF).","Cauchy distribution quantile function.","Chi distribution.","Chi distribution cumulative distribution function (CDF).","Chi distribution constructor.","Chi distribution entropy.","Chi distribution excess kurtosis.","Natural logarithm of the probability density function (PDF) for a chi distribution.","Chi distribution expected value.","Chi distribution mode.","Chi distribution probability density function (PDF).","Chi distribution quantile function.","Chi distribution skewness.","Chi distribution standard deviation.","Chi distribution variance.","Chi-squared distribution.","Chi-squared distribution cumulative distribution function (CDF).","Chi-squared distribution constructor.","Chi-squared distribution entropy.","Chi-squared distribution kurtosis.","Natural logarithm of the probability density function (PDF) for a chi-squared distribution.","Chi-squared distribution expected value.","Chi-squared distribution median.","Chi-squared distribution moment-generating function (MGF).","Chi-squared distribution mode.","Chi-squared distribution probability density function (PDF).","Chi-squared distribution quantile function.","Chi-squared distribution skewness.","Chi-squared distribution standard deviation.","Chi-squared distribution variance.","Raised cosine distribution.","Raised cosine distribution cumulative distribution function (CDF).","Raised cosine distribution constructor.","Raised cosine distribution kurtosis.","Natural logarithm of cumulative distribution function (CDF) for a raised cosine distribution.","Raised cosine distribution logarithm of probability density function (PDF).","Raised cosine distribution expected value.","Raised cosine distribution median.","Raised cosine distribution moment-generating function (MGF).","Raised cosine distribution mode.","Raised cosine distribution probability density function (PDF).","Raised cosine distribution quantile function.","Raised cosine distribution skewness.","Raised cosine distribution standard deviation.","Raised cosine distribution variance.","Degenerate distribution.","Degenerate distribution cumulative distribution function (CDF).","Degenerate distribution constructor.","Degenerate distribution entropy.","Degenerate distribution logarithm of cumulative distribution function (logCDF).","Degenerate distribution logarithm of probability density function (logPDF).","Natural logarithm of the probability mass function (PMF) for a degenerate distribution.","Degenerate distribution expected value.","Degenerate distribution median.","Degenerate distribution moment-generating function (MGF).","Degenerate distribution mode.","Degenerate distribution probability density function (PDF).","Degenerate distribution probability mass function (PMF).","Degenerate distribution quantile function.","Degenerate distribution standard deviation.","Degenerate distribution variance.","Discrete uniform distribution.","Discrete uniform distribution cumulative distribution function (CDF).","Discrete uniform distribution constructor.","Discrete uniform distribution entropy.","Discrete uniform distribution excess kurtosis.","Natural logarithm of the cumulative distribution function (CDF)for a discrete uniform distribution.","Natural logarithm of the probability mass function (PMF) for a discrete uniform distribution.","Discrete uniform distribution expected value.","Discrete uniform distribution median.","Discrete uniform distribution moment-generating function (MGF).","Discrete uniform distribution probability mass function (PMF).","Discrete uniform distribution quantile function.","Discrete uniform distribution skewness.","Discrete uniform distribution standard deviation.","Discrete uniform distribution variance.","Erlang distribution.","Erlang distribution cumulative distribution function (CDF).","Erlang distribution constructor.","Erlang distribution differential entropy.","Erlang distribution excess kurtosis.","Natural logarithm of the probability density function (PDF) for an Erlang distribution.","Erlang distribution expected value.","Erlang distribution moment-generating function (MGF).","Erlang distribution mode.","Erlang distribution probability density function (PDF).","Erlang distribution quantile function.","Erlang distribution skewness.","Erlang distribution standard deviation.","Erlang distribution variance.","Exponential distribution.","Exponential distribution cumulative distribution function (CDF).","Exponential distribution constructor.","Exponential distribution differential entropy.","Exponential distribution excess kurtosis.","Natural logarithm of the cumulative distribution function (CDF) for an exponential distribution.","Natural logarithm of the probability density function (PDF) for an exponential distribution.","Exponential distribution expected value.","Exponential distribution median.","Exponential distribution moment-generating function (MGF).","Exponential distribution mode.","Exponential distribution probability density function (PDF).","Exponential distribution quantile function.","Exponential distribution skewness.","Exponential distribution standard deviation.","Exponential distribution variance.","Fisher's F distribution.","F distribution cumulative distribution function (CDF).","F distribution constructor.","F distribution differential entropy.","F distribution excess kurtosis.","F distribution expected value.","F distribution mode.","F distribution probability density function (PDF).","F distribution quantile function.","F distribution skewness.","F distribution standard deviation.","F distribution variance.","Fréchet distribution.","Fréchet distribution cumulative distribution function (CDF).","Fréchet distribution constructor.","Fréchet distribution differential entropy.","Fréchet distribution kurtosis.","Fréchet distribution logarithm of cumulative distribution function (CDF).","Fréchet distribution logarithm of probability density function (PDF).","Fréchet distribution expected value.","Fréchet distribution median.","Fréchet distribution mode.","Fréchet distribution probability density function (PDF).","Fréchet distribution quantile function.","Fréchet distribution skewness.","Fréchet distribution standard deviation.","Fréchet distribution variance.","Gamma distribution.","Gamma distribution cumulative distribution function (CDF).","Gamma distribution constructor.","Gamma distribution differential entropy.","Gamma distribution excess kurtosis.","Gamma distribution logarithm of cumulative distribution function (CDF).","Gamma distribution logarithm of probability density function (PDF).","Gamma distribution expected value.","Gamma distribution moment-generating function (MGF).","Gamma distribution mode.","Gamma  distribution probability density function (PDF).","Gamma distribution quantile function.","Gamma distribution skewness.","Gamma distribution standard deviation.","Gamma distribution variance.","Geometric distribution.","Geometric distribution cumulative distribution function (CDF).","Geometric distribution constructor.","Geometric distribution entropy.","Geometric distribution excess kurtosis.","Geometric distribution logarithm of cumulative distribution function (CDF).","Geometric distribution logarithm of probability mass function (PMF).","Geometric distribution expected value.","Geometric distribution median.","Geometric distribution moment-generating function (MGF).","Geometric distribution mode.","Geometric distribution probability mass function (PMF).","Geometric distribution quantile function.","Geometric distribution skewness.","Geometric distribution standard deviation.","Geometric distribution variance.","Gumbel distribution.","Gumbel distribution cumulative distribution function (CDF).","Gumbel distribution constructor.","Gumbel distribution entropy.","Gumbel distribution excess kurtosis.","Gumbel distribution logarithm of cumulative distribution function.","Gumbel distribution logarithm of probability density function (PDF).","Gumbel distribution mean.","Gumbel distribution median.","Gumbel distribution moment-generating function (MGF).","Gumbel distribution mode.","Gumbel distribution probability density function (PDF).","Gumbel distribution quantile function.","Gumbel distribution skewness.","Gumbel distribution standard deviation.","Gumbel distribution variance.","Hypergeometric distribution.","Hypergeometric distribution cumulative distribution function (CDF).","Hypergeometric distribution constructor.","Hypergeometric distribution excess kurtosis.","Natural logarithm of the probability mass function (PMF) for a hypergeometric distribution.","Hypergeometric distribution expected value.","Hypergeometric distribution mode.","Hypergeometric distribution probability mass function (PMF).","Hypergeometric distribution quantile function.","Hypergeometric distribution skewness.","Hypergeometric distribution standard deviation.","Hypergeometric distribution variance.","Inverse gamma distribution.","Inverse gamma distribution cumulative distribution function (CDF).","Inverse gamma distribution constructor.","Inverse gamma distribution differential entropy.","Inverse gamma distribution excess kurtosis.","Natural logarithm of the probability density function (PDF) for an inverse gamma distribution.","Inverse gamma distribution expected value.","Inverse gamma distribution mode.","Inverse gamma distribution probability density function (PDF).","Inverse gamma distribution quantile function.","Inverse gamma distribution skewness.","Inverse gamma distribution standard deviation.","Inverse gamma distribution variance.","Kumaraswamy's double bounded distribution.","Kumaraswamy's double bounded distribution cumulative distribution function (CDF).","Kumaraswamy's double bounded distribution constructor.","Kumaraswamy's double bounded distribution excess kurtosis.","Natural logarithm of the cumulative distribution function (CDF)for a Kumaraswamy's double bounded distribution.","Natural logarithm of the probability density function (PDF) for a Kumaraswamy's double bounded distribution.","Kumaraswamy's double bounded distribution expected value.","Kumaraswamy's double bounded distribution median.","Kumaraswamy's double bounded distribution mode.","Kumaraswamy's double bounded distribution probability density function (PDF).","Kumaraswamy's double bounded distribution quantile function.","Kumaraswamy's double bounded distribution skewness.","Kumaraswamy's double bounded distribution standard deviation.","Kumaraswamy's double bounded distribution variance.","Laplace distribution.","Laplace distribution cumulative distribution function (CDF).","Laplace distribution constructor.","Laplace distribution differential entropy.","Laplace distribution excess kurtosis.","Laplace distribution logarithm of cumulative distribution function (CDF).","Laplace distribution logarithm of probability density function (PDF).","Laplace distribution expected value.","Laplace distribution median.","Laplace (Double Exponential) distribution moment-generating function (MGF).","Laplace distribution mode.","Laplace distribution probability density function (PDF).","Laplace distribution quantile function.","Laplace distribution skewness.","Laplace distribution standard deviation.","Laplace distribution variance.","Lévy distribution.","Lévy distribution cumulative distribution function (CDF).","Lévy distribution constructor.","Lévy distribution entropy.","Lévy distribution logarithm of cumulative distribution function (CDF).","Lévy distribution logarithm of probability density function (PDF).","Lévy distribution expected value.","Lévy distribution median.","Lévy distribution mode.","Lévy distribution probability density function (PDF).","Lévy distribution quantile function.","Lévy distribution standard deviation.","Lévy distribution variance.","Logistic distribution.","Logistic distribution cumulative distribution function (CDF).","Logistic distribution constructor.","Logistic distribution entropy.","Logistic distribution kurtosis.","Logistic distribution logarithm of cumulative distribution function (CDF).","Logistic distribution logarithm of probability density function (PDF).","Logistic distribution expected value.","Logistic distribution median.","Logistic distribution moment-generating function (MGF).","Logistic distribution mode.","Logistic distribution probability density function (PDF).","Logistic distribution quantile function.","Logistic distribution skewness.","Logistic distribution standard deviation.","Logistic distribution variance.","Lognormal distribution.","Lognormal distribution cumulative distribution function (CDF).","Lognormal distribution constructor.","Lognormal distribution differential entropy.","Lognormal distribution kurtosis.","Natural logarithm of the probability density function (PDF) for a lognormal distribution.","Lognormal distribution expected value.","Lognormal distribution median.","Lognormal distribution mode.","Lognormal distribution probability density function (PDF).","Lognormal distribution quantile function.","Lognormal distribution skewness.","Lognormal distribution standard deviation.","Lognormal distribution variance.","Negative binomial distribution.","Negative binomial distribution cumulative distribution function (CDF).","Negative binomial distribution constructor.","Negative binomial distribution excess kurtosis.","Natural logarithm of the probability mass function (PMF) for a negative binomial distribution.","Negative binomial distribution expected value.","Negative binomial distribution moment-generating function (MGF).","Negative binomial distribution mode.","Negative binomial distribution probability mass function (PMF).","Negative binomial distribution quantile function.","Negative binomial distribution skewness.","Negative binomial distribution standard deviation.","Negative binomial distribution variance.","Normal distribution.","Normal distribution cumulative distribution function (CDF).","Normal distribution constructor.","Normal distribution differential entropy.","Normal distribution excess kurtosis.","Natural logarithm of the probability density function (PDF) for a normal distribution.","Normal distribution expected value.","Normal distribution median.","Normal distribution moment-generating function (MGF).","Normal distribution mode.","Normal distribution probability density function (PDF).","Normal distribution quantile function.","Normal distribution skewness.","Normal distribution standard deviation.","Normal distribution variance.","Pareto (Type I) distribution.","Pareto (Type I) distribution cumulative distribution function (CDF).","Pareto (Type I) distribution constructor.","Pareto (Type I) distribution differential entropy.","Pareto (Type I) distribution excess kurtosis.","Natural logarithm of the cumulative distribution function (CDF)for a Pareto (Type I) distribution.","Natural logarithm of the probability density function (PDF) for a Pareto (Type I) distribution.","Pareto (Type I) distribution expected value.","Pareto (Type I) distribution median.","Pareto (Type I) distribution mode.","Pareto  distribution (Type I) probability density function (PDF).","Pareto (Type I) distribution quantile function.","Pareto (Type I) distribution skewness.","Pareto (Type I) distribution standard deviation.","Pareto (Type I) distribution variance.","Poisson distribution.","Poisson distribution cumulative distribution function (CDF).","Poisson distribution constructor.","Poisson distribution entropy.","Poisson distribution excess kurtosis.","Natural logarithm of the probability mass function (PMF) for a Poisson distribution.","Poisson distribution expected value.","Poisson distribution median.","Poisson distribution moment-generating function (MGF).","Poisson distribution mode.","Poisson distribution probability mass function (PMF).","Poisson distribution quantile function.","Poisson distribution skewness.","Poisson distribution standard deviation.","Poisson distribution variance.","Rayleigh distribution.","Rayleigh distribution cumulative distribution function (CDF).","Rayleigh distribution constructor.","Rayleigh distribution differential entropy.","Rayleigh distribution excess kurtosis.","Rayleigh distribution logarithm of cumulative distribution function (CDF).","Rayleigh distribution logarithm of probability density function (PDF).","Rayleigh distribution expected value.","Rayleigh distribution median.","Rayleigh distribution moment-generating function (MGF).","Rayleigh distribution mode.","Rayleigh distribution probability density function (PDF).","Rayleigh distribution quantile function.","Rayleigh distribution skewness.","Rayleigh distribution standard deviation.","Rayleigh distribution variance.","Distribution of Wilcoxon signed rank test statistic.","Wilcoxon signed rank test statistic cumulative distribution function (CDF).","Wilcoxon signed rank test statistic probability density function (PDF).","Wilcoxon signed rank test statistic quantile function.","Student's t distribution.","Student's t distribution cumulative distribution function (CDF).","Student's t distribution constructor.","Student's t distribution entropy.","Student's t distribution excess kurtosis.","Natural logarithm of the cumulative distribution function (CDF) for a Student's t distribution.","Natural logarithm of the probability density function (PDF) for a Student's t distribution.","Student's t distribution expected value.","Student's t distribution median.","Student's t distribution mode.","Student's t distribution probability density function (PDF).","Student's t distribution quantile function.","Student's t distribution skewness.","Student's t distribution standard deviation.","Student's t distribution variance.","Triangular distribution.","Triangular distribution cumulative distribution function (CDF).","Triangular distribution constructor.","Triangular distribution differential entropy.","Triangular distribution excess kurtosis.","Triangular distribution logarithm of cumulative distribution function (CDF).","Triangular distribution logarithm of probability density function (PDF).","Triangular distribution expected value.","Triangular distribution median.","Triangular distribution moment-generating function (MGF).","Triangular distribution mode.","Triangular distribution probability density function (PDF).","Triangular distribution quantile function.","Triangular distribution skewness.","Triangular distribution standard deviation.","Triangular distribution variance.","Truncated normal distribution.","Truncated normal distribution probability density function (PDF).","Uniform distribution.","Uniform distribution cumulative distribution function (CDF).","Uniform distribution constructor.","Uniform distribution differential entropy.","Uniform distribution excess kurtosis.","Uniform distribution logarithm of cumulative distribution function (CDF).","Uniform distribution logarithm of probability density function (PDF).","Uniform distribution expected value.","Uniform distribution median.","Uniform distribution moment-generating function (MGF).","Uniform distribution probability density function (PDF).","Uniform distribution quantile function.","Uniform distribution skewness.","Uniform distribution standard deviation.","Uniform distribution variance.","Weibull distribution.","Weibull distribution cumulative distribution function (CDF).","Weibull distribution constructor.","Weibull distribution differential entropy.","Weibull distribution excess kurtosis.","Weibull distribution logarithm of cumulative distribution function (CDF).","Weibull distribution logarithm of probability density function (PDF).","Weibull distribution expected value.","Weibull distribution median.","Weibull distribution moment-generating function (MGF).","Weibull distribution mode.","Weibull distribution probability density function (PDF).","Weibull distribution quantile function.","Weibull distribution skewness.","Weibull distribution standard deviation.","Weibull distribution variance.","Calculate the maximum value of a double-precision floating-point strided array.","Calculate the maximum absolute value of a double-precision floating-point strided array.","Calculate the maximum absolute value of a sorted double-precision floating-point strided array.","Calculate the maximum value of a sorted double-precision floating-point strided array.","Calculate the arithmetic mean of a double-precision floating-point strided array.","Calculate the arithmetic mean of a double-precision floating-point strided array using an improved Kahan–Babuška algorithm.","Calculate the arithmetic mean of a double-precision floating-point strided array using a second-order iterative Kahan–Babuška algorithm.","Calculate the arithmetic mean of a double-precision floating-point strided array using a one-pass trial mean algorithm.","Calculate the arithmetic mean of a double-precision floating-point strided array using a one-pass trial mean algorithm with pairwise summation.","Calculate the arithmetic mean of a double-precision floating-point strided array using ordinary recursive summation.","Calculate the arithmetic mean of a double-precision floating-point strided array using a two-pass error correction algorithm.","Calculate the arithmetic mean of a double-precision floating-point strided array using pairwise summation.","Calculate the mean and standard deviation of a double-precision floating-point strided array.","Calculate the mean and standard deviation of a double-precision floating-point strided array using a two-pass algorithm.","Calculate the mean and variance of a double-precision floating-point strided array.","Calculate the mean and variance of a double-precision floating-point strided array using a two-pass algorithm.","Calculate the arithmetic mean of a double-precision floating-point strided array using Welford's algorithm.","Calculate the median value of a sorted double-precision floating-point strided array.","Calculate the mid-range of a double-precision floating-point strided array.","Calculate the minimum value of a double-precision floating-point strided array.","Calculate the minimum absolute value of a double-precision floating-point strided array.","Calculate the minimum value of a sorted double-precision floating-point strided array.","Calculate the maximum value of a double-precision floating-point strided array according to a mask.","Calculate the minimum value of a double-precision floating-point strided array according to a mask.","Calculate the range of a double-precision floating-point strided array according to a mask.","Calculate the maximum value of a double-precision floating-point strided array, ignoring NaN values.","Calculate the maximum absolute value of a double-precision floating-point strided array, ignoring NaN values.","Calculate the arithmetic mean of a double-precision floating-point strided array, ignoring NaN values.","Calculate the arithmetic mean of a double-precision floating-point strided array, ignoring NaN values and using ordinary recursive summation.","Calculate the arithmetic mean of a double-precision floating-point strided array, ignoring NaN values and using a two-pass error correction algorithm.","Calculate the arithmetic mean of a double-precision floating-point strided array, ignoring NaN values and using pairwise summation.","Calculate the arithmetic mean of a double-precision floating-point strided array, using Welford's algorithm and ignoring NaN values.","Calculate the minimum value of a double-precision floating-point strided array, ignoring NaN values.","Calculate the minimum absolute value of a double-precision floating-point strided array, ignoring NaN values.","Calculate the maximum value of a double-precision floating-point strided array according to a mask, ignoring NaN values.","Calculate the minimum value of a double-precision floating-point strided array according to a mask, ignoring NaN values.","Calculate the range of a double-precision floating-point strided array according to a mask, ignoring NaN values.","Calculate the range of a double-precision floating-point strided array, ignoring NaN values.","Calculate the standard deviation of a double-precision floating-point strided array ignoring NaN values.","Calculate the standard deviation of a double-precision floating-point strided array ignoring NaN values and using a one-pass trial mean algorithm.","Calculate the standard deviation of a double-precision floating-point strided array ignoring NaN values and using a two-pass algorithm.","Calculate the standard deviation of a double-precision floating-point strided array ignoring NaN values and using a one-pass textbook algorithm.","Calculate the standard deviation of a double-precision floating-point strided array ignoring NaN values and using Welford's algorithm.","Calculate the standard deviation of a double-precision floating-point strided array ignoring NaN values and using a one-pass algorithm proposed by Youngs and Cramer.","Calculate the variance of a double-precision floating-point strided array ignoring NaN values.","Calculate the variance of a double-precision floating-point strided array ignoring NaN values and using a one-pass trial mean algorithm.","Calculate the variance of a double-precision floating-point strided array ignoring NaN values and using a two-pass algorithm.","Calculate the variance of a double-precision floating-point strided array ignoring NaN values and using a one-pass textbook algorithm.","Calculate the variance of a double-precision floating-point strided array ignoring NaN values and using Welford's algorithm.","Calculate the variance of a double-precision floating-point strided array ignoring NaN values and using a one-pass algorithm proposed by Youngs and Cramer.","Calculate the range of a double-precision floating-point strided array.","Calculate the standard error of the mean for a double-precision floating-point strided array.","Calculate the standard error of the mean for a double-precision floating-point strided array using a one-pass trial mean algorithm.","Calculate the standard error of the mean for a double-precision floating-point strided array using a two-pass algorithm.","Calculate the standard error of the mean for a double-precision floating-point strided array using a one-pass textbook algorithm.","Calculate the standard error of the mean for a double-precision floating-point strided array using Welford's algorithm.","Calculate the standard error of the mean for a double-precision floating-point strided array using a one-pass algorithm proposed by Youngs and Cramer.","Calculate the arithmetic mean of a single-precision floating-point strided array using extended accumulation and returning an extended precision result.","Calculate the arithmetic mean of a single-precision floating-point strided array using ordinary recursive summation with extended accumulation and returning an extended precision result.","Calculate the arithmetic mean of a single-precision floating-point strided array using a two-pass error correction algorithm with extended accumulation and returning an extended precision result.","Calculate the arithmetic mean of a single-precision floating-point strided array using pairwise summation with extended accumulation and returning an extended precision result.","Calculate the arithmetic mean of a single-precision floating-point strided array using Welford's algorithm with extended accumulation and returning an extended precision result.","Calculate the arithmetic mean of a single-precision floating-point strided array, ignoring NaN values, using extended accumulation, and returning an extended precision result.","Calculate the arithmetic mean of a single-precision floating-point strided array, ignoring NaN values, using ordinary recursive summation with extended accumulation, and returning an extended precision result.","Calculate the arithmetic mean of a single-precision floating-point strided array, ignoring NaN values, using a two-pass error correction algorithm with extended accumulation, and returning an extended precision result.","Calculate the arithmetic mean of a single-precision floating-point strided array, ignoring NaN values, using Welford's algorithm with extended accumulation, and returning an extended precision result.","Calculate the standard deviation of a double-precision floating-point strided array.","Calculate the standard deviation of a double-precision floating-point strided array using a one-pass trial mean algorithm.","Calculate the standard deviation of a double-precision floating-point strided array using a two-pass algorithm.","Calculate the standard deviation of a double-precision floating-point strided array using a one-pass textbook algorithm.","Calculate the standard deviation of a double-precision floating-point strided array using Welford's algorithm.","Calculate the standard deviation of a double-precision floating-point strided array using a one-pass algorithm proposed by Youngs and Cramer.","Calculate the variance of a single-precision floating-point strided array using extended accumulation and returning an extended precision result.","Calculate the variance of a single-precision floating-point strided array using a two-pass algorithm with extended accumulation and returning an extended precision result.","Calculate the variance of a double-precision floating-point strided array.","Calculate the variance of a double-precision floating-point strided array using a one-pass trial mean algorithm.","Calculate the variance of a double-precision floating-point strided array using a two-pass algorithm.","Calculate the variance of a double-precision floating-point strided array using a one-pass textbook algorithm.","Calculate the variance of a double-precision floating-point strided array using Welford's algorithm.","Calculate the variance of a double-precision floating-point strided array using a one-pass algorithm proposed by Youngs and Cramer.","Calculate the variance of a double-precision floating-point strided array provided a known mean.","Calculate the variance of a double-precision floating-point strided array provided a known mean and using Neely's correction algorithm.","Calculate the variance of a double-precision floating-point strided array provided a known mean and using a one-pass textbook algorithm.","Calculate the maximum value of a strided array.","Calculate the maximum value of a strided array via a callback function.","Calculate the maximum absolute value of a strided array.","Calculate the maximum value of a sorted strided array.","Calculate the arithmetic mean of a strided array.","Calculate the arithmetic mean of a strided array using an improved Kahan–Babuška algorithm.","Calculate the arithmetic mean of a strided array using a second-order iterative Kahan–Babuška algorithm.","Calculate the arithmetic mean of a strided array using ordinary recursive summation.","Calculate the arithmetic mean of a strided array using a two-pass error correction algorithm.","Calculate the arithmetic mean of a strided array using pairwise summation.","Calculate the arithmetic mean of a strided array using Welford's algorithm.","Calculate the median value of a sorted strided array.","Calculate the minimum value of a strided array.","Calculate the minimum value of a strided array via a callback function.","Calculate the minimum absolute value of a strided array.","Calculate the minimum value of a sorted strided array.","Calculate the maximum value of a strided array according to a mask.","Calculate the minimum value of a strided array according to a mask.","Calculate the range of a strided array according to a mask.","Calculate the maximum value of a strided array, ignoring NaN values.","Calculate the maximum value of a strided array via a callback function, ignoring NaN values.","Calculate the maximum absolute value of a strided array, ignoring NaN values.","Calculate the arithmetic mean of a strided array, ignoring NaN values.","Calculate the arithmetic mean of a strided array, ignoring NaN values and using ordinary recursive summation.","Calculate the arithmetic mean of a strided array, ignoring NaN values and using a two-pass error correction algorithm.","Calculate the arithmetic mean of a strided array, ignoring NaN values and using Welford's algorithm.","Calculate the minimum value of a strided array, ignoring NaN values.","Calculate the minimum value of a strided array via a callback function, ignoring NaN values.","Calculate the minimum absolute value of a strided array, ignoring NaN values.","Calculate the maximum value of a strided array according to a mask, ignoring NaN values.","Calculate the minimum value of a strided array according to a mask, ignoring NaN values.","Calculate the range of a strided array according to a mask, ignoring NaN values.","Calculate the range of a strided array, ignoring NaN values.","Calculate the range of a strided array via a callback function, ignoring NaN values.","Calculate the standard deviation of a strided array ignoring NaN values.","Calculate the standard deviation of a strided array ignoring NaN values and using a one-pass trial mean algorithm.","Calculate the standard deviation of a strided array ignoring NaN values and using a two-pass algorithm.","Calculate the standard deviation of a strided array ignoring NaN values and using a one-pass textbook algorithm.","Calculate the standard deviation of a strided array ignoring NaN values and using Welford's algorithm.","Calculate the standard deviation of a strided array ignoring NaN values and using a one-pass algorithm proposed by Youngs and Cramer.","Calculate the variance of a strided array ignoring NaN values.","Calculate the variance of a strided array ignoring NaN values and using a one-pass trial mean algorithm.","Calculate the variance of a strided array ignoring NaN values and using a two-pass algorithm.","Calculate the variance of a strided array ignoring NaN values and using a one-pass textbook algorithm.","Calculate the variance of a strided array ignoring NaN values and using Welford's algorithm.","Calculate the variance of a strided array ignoring NaN values and using a one-pass algorithm proposed by Youngs and Cramer.","Calculate the range of a strided array.","Calculate the range of a strided array via a callback function.","Calculate the cumulative maximum of single-precision floating-point strided array elements.","Calculate the cumulative maximum absolute value of single-precision floating-point strided array elements.","Calculate the cumulative minimum of single-precision floating-point strided array elements.","Calculate the cumulative minimum absolute value of single-precision floating-point strided array elements.","Calculate the arithmetic mean of a single-precision floating-point strided array using extended accumulation.","Calculate the arithmetic mean of a single-precision floating-point strided array using ordinary recursive summation with extended accumulation.","Calculate the arithmetic mean of a single-precision floating-point strided array, ignoring NaN values and using extended accumulation.","Calculate the arithmetic mean of a single-precision floating-point strided array, ignoring NaN values and using ordinary recursive summation with extended accumulation.","Calculate the maximum value of a single-precision floating-point strided array.","Calculate the maximum absolute value of a single-precision floating-point strided array.","Calculate the maximum absolute value of a sorted single-precision floating-point strided array.","Calculate the maximum value of a sorted single-precision floating-point strided array.","Calculate the arithmetic mean of a single-precision floating-point strided array.","Calculate the arithmetic mean of a single-precision floating-point strided array using an improved Kahan–Babuška algorithm.","Calculate the arithmetic mean of a single-precision floating-point strided array using a second-order iterative Kahan–Babuška algorithm.","Calculate the arithmetic mean of a single-precision floating-point strided array using a one-pass trial mean algorithm.","Calculate the arithmetic mean of a single-precision floating-point strided array using a one-pass trial mean algorithm with pairwise summation.","Calculate the arithmetic mean of a single-precision floating-point strided array using ordinary recursive summation.","Calculate the arithmetic mean of a single-precision floating-point strided array using a two-pass error correction algorithm.","Calculate the arithmetic mean of a single-precision floating-point strided array using pairwise summation.","Calculate the arithmetic mean of a single-precision floating-point strided array using Welford's algorithm.","Calculate the median value of a sorted single-precision floating-point strided array.","Calculate the mid-range of a single-precision floating-point strided array.","Calculate the minimum value of a single-precision floating-point strided array.","Calculate the minimum absolute value of a single-precision floating-point strided array.","Calculate the minimum value of a sorted single-precision floating-point strided array.","Calculate the maximum value of a single-precision floating-point strided array according to a mask.","Calculate the minimum value of a single-precision floating-point strided array according to a mask.","Calculate the range of a single-precision floating-point strided array according to a mask.","Calculate the maximum value of a single-precision floating-point strided array, ignoring NaN values.","Calculate the maximum absolute value of a single-precision floating-point strided array, ignoring NaN values.","Calculate the arithmetic mean of a single-precision floating-point strided array, ignoring NaN values.","Calculate the arithmetic mean of a single-precision floating-point strided array, ignoring NaN values and using ordinary recursive summation.","Calculate the arithmetic mean of a single-precision floating-point strided array, ignoring NaN values and using a two-pass error correction algorithm.","Calculate the arithmetic mean of a single-precision floating-point strided array, ignoring NaN values and using Welford's algorithm.","Calculate the minimum value of a single-precision floating-point strided array, ignoring NaN values.","Calculate the minimum absolute value of a single-precision floating-point strided array, ignoring NaN values.","Calculate the maximum value of a single-precision floating-point strided array according to a mask, ignoring NaN values.","Calculate the minimum value of a single-precision floating-point strided array according to a mask, ignoring NaN values.","Calculate the range of a single-precision floating-point strided array according to a mask, ignoring NaN values.","Calculate the range of a single-precision floating-point strided array, ignoring NaN values.","Calculate the standard deviation of a single-precision floating-point strided array ignoring NaN values.","Calculate the standard deviation of a single-precision floating-point strided array ignoring NaN values and using a one-pass trial mean algorithm.","Calculate the standard deviation of a single-precision floating-point strided array ignoring NaN values and using a two-pass algorithm.","Calculate the standard deviation of a single-precision floating-point strided array ignoring NaN values and using a one-pass textbook algorithm.","Calculate the standard deviation of a single-precision floating-point strided array ignoring NaN values and using Welford's algorithm.","Calculate the standard deviation of a single-precision floating-point strided array ignoring NaN values and using a one-pass algorithm proposed by Youngs and Cramer.","Calculate the variance of a single-precision floating-point strided array ignoring NaN values.","Calculate the variance of a single-precision floating-point strided array ignoring NaN values and using a one-pass trial mean algorithm.","Calculate the variance of a single-precision floating-point strided array ignoring NaN values and using a two-pass algorithm.","Calculate the variance of a single-precision floating-point strided array ignoring NaN values and using a one-pass textbook algorithm.","Calculate the variance of a single-precision floating-point strided array ignoring NaN values and using Welford's algorithm.","Calculate the variance of a single-precision floating-point strided array ignoring NaN values and using a one-pass algorithm proposed by Youngs and Cramer.","Calculate the range of a single-precision floating-point strided array.","Calculate the standard deviation of a single-precision floating-point strided array.","Calculate the standard deviation of a single-precision floating-point strided array using a one-pass trial mean algorithm.","Calculate the standard deviation of a single-precision floating-point strided array using a two-pass algorithm.","Calculate the standard deviation of a single-precision floating-point strided array using a one-pass textbook algorithm.","Calculate the standard deviation of a single-precision floating-point strided array using Welford's algorithm.","Calculate the standard deviation of a single-precision floating-point strided array using a one-pass algorithm proposed by Youngs and Cramer.","Calculate the standard deviation of a strided array.","Calculate the standard deviation of a strided array using a one-pass trial mean algorithm.","Calculate the standard deviation of a strided array using a two-pass algorithm.","Calculate the standard deviation of a strided array using a one-pass textbook algorithm.","Calculate the standard deviation of a strided array using Welford's algorithm.","Calculate the standard deviation of a strided array using a one-pass algorithm proposed by Youngs and Cramer.","Calculate the variance of a single-precision floating-point strided array.","Calculate the variance of a single-precision floating-point strided array using a one-pass trial mean algorithm.","Calculate the variance of a single-precision floating-point strided array using a two-pass algorithm.","Calculate the variance of a single-precision floating-point strided array using a one-pass textbook algorithm.","Calculate the variance of a single-precision floating-point strided array using Welford's algorithm.","Calculate the variance of a single-precision floating-point strided array using a one-pass algorithm proposed by Youngs and Cramer.","Calculate the variance of a strided array.","Calculate the variance of a strided array using a one-pass trial mean algorithm.","Calculate the variance of a strided array using a two-pass algorithm.","Calculate the variance of a strided array using a one-pass textbook algorithm.","Calculate the variance of a strided array using Welford's algorithm.","Calculate the variance of a strided array using a one-pass algorithm proposed by Youngs and Cramer.","Exact test for the success probability in a Bernoulli experiment.","Perform a chi-square goodness-of-fit test.","Perform a chi-square independence test.","Fligner-Killeen test for equal variances.","Incremental statistics.","Compute a sample absolute Pearson product-moment correlation coefficient.","Compute a count incrementally.","Compute an unbiased sample covariance incrementally.","Compute an unbiased sample covariance matrix incrementally.","Compute the coefficient of variation (CV) incrementally.","Compute an exponentially weighted mean incrementally.","Compute an exponentially weighted standard deviation incrementally.","Compute an exponentially weighted variance incrementally.","Compute a geometric mean incrementally.","Grubbs' test for outliers.","Compute a harmonic mean incrementally.","Compute a corrected sample excess kurtosis incrementally.","Compute the mean arctangent absolute percentage error (MAAPE) incrementally.","Compute the mean absolute error (MAE) incrementally.","Compute a moving sample absolute Pearson product-moment correlation coefficient incrementally.","Compute the mean absolute percentage error (MAPE) incrementally.","Compute a maximum value incrementally.","Compute a maximum absolute value incrementally.","Compute a moving unbiased sample covariance incrementally.","Compute a moving coefficient of variation (CV) incrementally.","Compute the mean directional accuracy (MDA) incrementally.","Compute the mean error (ME) incrementally.","Compute an arithmetic mean incrementally.","Compute an arithmetic mean of absolute values incrementally.","Compute an arithmetic mean of squared absolute values incrementally.","Compute an arithmetic mean and corrected sample standard deviation incrementally.","Compute an arithmetic mean and unbiased sample variance incrementally.","Compute a moving geometric mean incrementally.","Moving Grubbs' test for outliers.","Compute a moving harmonic mean incrementally.","Compute a mid-range incrementally.","Compute a minimum value incrementally.","Compute a minimum absolute value incrementally.","Compute a minimum and maximum incrementally.","Compute minimum and maximum absolute values incrementally.","Compute a moving arctangent mean absolute percentage error (MAAPE) incrementally.","Compute a moving mean absolute error (MAE) incrementally.","Compute a moving mean absolute percentage error (MAPE) incrementally.","Compute a moving maximum incrementally.","Compute a moving maximum absolute value incrementally.","Compute a moving mean directional accuracy (MDA) incrementally.","Compute a moving mean error (ME) incrementally.","Compute a moving arithmetic mean incrementally.","Compute a moving arithmetic mean of absolute values incrementally.","Compute a moving arithmetic mean of squared absolute values incrementally.","Compute a moving arithmetic mean and corrected sample standard deviation incrementally.","Compute a moving arithmetic mean and unbiased sample variance incrementally.","Compute a moving mid-range incrementally.","Compute a moving minimum incrementally.","Compute a moving minimum absolute value incrementally.","Compute a moving minimum and maximum incrementally.","Compute moving minimum and maximum absolute values incrementally.","Compute a moving mean percentage error (MPE) incrementally.","Compute a moving mean squared error (MSE) incrementally.","Compute a moving sample Pearson product-moment correlation coefficient incrementally.","Compute a moving squared sample Pearson product-moment correlation coefficient incrementally.","Compute a moving sample Pearson product-moment correlation distance incrementally.","Compute the mean percentage error (MPE) incrementally.","Compute a moving product incrementally.","Compute a moving range incrementally.","Compute a moving root mean squared error (RMSE) incrementally.","Compute a moving residual sum of squares (RSS) incrementally.","Compute the mean squared error (MSE) incrementally.","Compute a moving corrected sample standard deviation incrementally.","Compute a moving sum incrementally.","Compute a moving sum of absolute values incrementally.","Compute a moving sum of squared absolute values incrementally.","Compute a moving statistical summary incrementally.","Compute a moving sum of products incrementally.","Compute a moving unbiased sample variance incrementally.","Compute a moving variance-to-mean ratio (VMR) incrementally.","Compute a count incrementally, ignoring NaN values.","Compute a sum incrementally, ignoring NaN values.","Compute a sum of absolute values incrementally, ignoring NaN values.","Compute a sum of squared absolute values incrementally, ignoring NaN values.","Compute a sample Pearson product-moment correlation coefficient.","Compute a squared sample Pearson product-moment correlation coefficient.","Compute a sample Pearson product-moment correlation distance.","Compute a sample Pearson product-moment correlation distance matrix incrementally.","Compute a sample Pearson product-moment correlation matrix incrementally.","Compute a product incrementally.","Compute a range incrementally.","Compute the root mean squared error (RMSE) incrementally.","Compute the residual sum of squares (RSS) incrementally.","Compute a corrected sample skewness incrementally.","Compute a corrected sample standard deviation incrementally.","Compute a sum incrementally.","Compute a sum of absolute values incrementally.","Compute a sum of squared absolute values incrementally.","Compute a statistical summary incrementally.","Compute a sum of products incrementally.","Compute an unbiased sample variance incrementally.","Compute a variance-to-mean ratio (VMR) incrementally.","Compute a weighted arithmetic mean incrementally.","Statistical function iterators.","Create an iterator which iteratively computes a cumulative geometric mean.","Create an iterator which iteratively computes a cumulative harmonic mean.","Create an iterator which iteratively computes a cumulative maximum value.","Create an iterator which iteratively computes a cumulative maximum absolute value.","Create an iterator which iteratively computes a cumulative arithmetic mean.","Create an iterator which iteratively computes a cumulative arithmetic mean of absolute values.","Create an iterator which iteratively computes a cumulative arithmetic mean of squared absolute values.","Create an iterator which iteratively computes a cumulative mid-range.","Create an iterator which iteratively computes a cumulative minimum value.","Create an iterator which iteratively computes a cumulative minimum absolute value.","Create an iterator which iteratively computes a cumulative product.","Create an iterator which iteratively computes a cumulative range.","Create an iterator which iteratively computes a cumulative sum.","Create an iterator which iteratively computes a cumulative sum of absolute values.","Create an iterator which iteratively computes a cumulative sum of squared absolute values.","Compute the maximum value of all iterated values.","Compute the maximum absolute value of all iterated values.","Compute the arithmetic mean over all iterated values.","Compute the arithmetic mean of absolute values for all iterated values.","Compute the arithmetic mean of squared absolute values for all iterated values.","Compute the mid-range of all iterated values.","Compute the minimum value of all iterated values.","Compute the minimum absolute value of all iterated values.","Create an iterator which iteratively computes a moving maximum value.","Create an iterator which iteratively computes a moving maximum absolute value.","Create an iterator which iteratively computes a moving arithmetic mean.","Create an iterator which iteratively computes a moving arithmetic mean of absolute values.","Create an iterator which iteratively computes a moving arithmetic mean of squared absolute values.","Create an iterator which iteratively computes a moving mid-range.","Create an iterator which iteratively computes a moving minimum value.","Create an iterator which iteratively computes a moving minimum absolute value.","Create an iterator which iteratively computes a moving product.","Create an iterator which iteratively computes a moving range.","Create an iterator which iteratively computes a moving sum.","Create an iterator which iteratively computes a moving sum of absolute values.","Create an iterator which iteratively computes a moving sum of squared absolute values.","Compute the product of all iterated values.","Compute the range of all iterated values.","Compute the corrected sample standard deviation over all iterated values.","Compute the sum of all iterated values.","Compute the sum of absolute values for all iterated values.","Compute the sum of squared absolute values for all iterated values.","Compute the unbiased sample variance over all iterated values.","Two-dimensional kernel density estimation.","Compute the Kruskal-Wallis test for equal medians.","One-sample Kolmogorov-Smirnov goodness-of-fit test.","Levene's test for equal variances.","Locally-weighted polynomial regression via the LOWESS algorithm.","Adjust supplied p-values for multiple comparisons via a specified method.","Compute a Pearson product-moment correlation test between paired samples.","Compute ranks for values of an array-like object.","One-sample and paired Student's t-Test.","Two-sample Student's t-Test.","Two-sample F-test for equal variances","Wilcoxon signed rank test.","One-sample and paired z-Test.","Two-sample z-Test.","Streams.","Node.js streams.","Transform stream for debugging stream pipelines.","Writable stream for debugging stream pipelines.","Create an empty readable stream.","Create a readable stream from an array-like object.","Create a readable stream from a circular array-like object.","Create a readable stream which always streams the same value.","Create a readable stream from an iterator.","Create a readable stream from a strided array-like object.","Transform stream for inspecting streamed data.","Writable stream for inspecting streamed data.","Transform stream which joins streamed data.","Transform stream which splits streamed data.","Standard error.","Standard input.","Standard output.","Transform stream.","Strided.","Base strided.","Apply a binary callback to elements in strided input arrays and assign results to elements in a strided output array.","Dispatch to a native add-on applying a binary function to two input strided arrays.","Generate a list of binary interface signatures from strided array data types.","Assign callbacks to binary interfaces according to type promotion rules.","Apply a unary function to a single-precision complex floating-point strided input array and assign results to a single-precision complex floating-point strided output array.","Apply a unary function to a double-precision floating-point strided input array and assign results to a double-precision floating-point strided output array.","Apply a binary function to double-precision floating-point strided input arrays and assign results to a double-precision floating-point strided output array.","Apply a unary function to a double-precision floating-point strided input array according to a strided mask array and assign results to a double-precision floating-point strided output array.","Apply a binary function to double-precision floating-point strided input arrays according to a strided mask array and assign results to a double-precision floating-point strided output array.","Return the data type string associated with a strided array data type enumeration constant.","Return the enumeration constant associated with a supported strided array data type value.","Return the data type string associated with a supported strided array data type value.","Return the enumeration constant associated with a strided array data type string.","C APIs for creating and managing strided array function objects.","Apply a unary function to each element retrieved from a strided input array according to a callback function and assign results to a strided output array.","Apply a binary function to each pair of elements retrieved from strided input arrays according to a callback function and assign results to a strided output array.","Return the maximum accessible index based on a set of provided strided array parameters.","Define non-enumerable read-only properties which expose strided array function meta data.","Return the minimum accessible index based on a set of provided strided array parameters.","Apply a unary callback to elements in a strided input array according to elements in a strided mask array and assign results to elements in a strided output array.","Apply a nullary callback and assign results to elements in a strided output array.","Return a typed array view having the same data type as a provided input typed array and starting at a specified index offset.","Apply a quaternary callback to strided input array elements and assign results to elements in a strided output array.","Apply a quinary callback to strided input array elements and assign results to elements in a strided output array.","Reinterpret a Complex128Array as a Float64Array.","Reinterpret a Complex64Array as a Float32Array.","Apply a unary function to a single-precision floating-point strided input array and assign results to a single-precision floating-point strided output array.","Apply a binary function to single-precision floating-point strided input arrays and assign results to a single-precision floating-point strided output array.","Apply a unary function to a single-precision floating-point strided input array according to a strided mask array and assign results to a single-precision floating-point strided output array.","Apply a binary function to single-precision floating-point strided input arrays according to a strided mask array and assign results to a single-precision floating-point strided output array.","Apply a ternary callback to strided input array elements and assign results to elements in a strided output array.","Apply a unary callback to elements in a strided input array and assign results to elements in a strided output array.","Dispatch to a native add-on applying a unary function to an input strided array.","Apply a unary function to a double-precision complex floating-point strided input array and assign results to a double-precision complex floating-point strided output array.","Native strided array utilities.","Create a strided array function interface which performs multiple dispatch.","List of strided array data types.","C APIs for creating Node-API strided array native add-ons.","C API for validating, extracting, and transforming (to native C types) function arguments provided to a strided array Node-API add-on interface.","C API for registering a Node-API module exporting a strided array interface for applying a binary callback to input strided arrays.","C API for registering a Node-API module exporting a strided array interface for applying a unary callback to a single-precision complex floating-point strided input array and assigning results to a single-precision complex floating-point strided output array.","C API for registering a Node-API module exporting a strided array interface for applying a unary callback to a double-precision floating-point strided input array and assigning results to a double-precision floating-point strided output array.","C API for registering a Node-API module exporting a strided array interface for applying a binary callback to double-precision floating-point strided input arrays and assigning results to a double-precision floating-point strided output array.","C API for registering a Node-API module exporting a strided array interface for applying a unary callback to a double-precision floating-point strided input array according to a strided mask array and assigning results to a double-precision floating-point strided output array.","C API for registering a Node-API module exporting a strided array interface for applying a binary callback to double-precision floating-point strided input arrays according to a strided mask array and assigning results to a double-precision floating-point strided output array.","C API for registering a Node-API module exporting a strided array interface for applying a unary callback to an input strided array according to a mask strided array.","C API for registering a Node-API module exporting a strided array interface for applying a unary callback to a single-precision floating-point strided input array and assigning results to a single-precision floating-point strided output array.","C API for registering a Node-API module exporting a strided array interface for applying a binary callback to single-precision floating-point strided input arrays and assigning results to a single-precision floating-point strided output array.","C API for registering a Node-API module exporting a strided array interface for applying a unary callback  to a single-precision floating-point strided input array according to a strided mask array and assigning results to a single-precision floating-point strided output array.","C API for registering a Node-API module exporting a strided array interface for applying a binary callback to single-precision floating-point strided input arrays according to a strided mask array and assigning results to a single-precision floating-point strided output array.","C API for registering a Node-API module exporting a strided array interface for applying a unary callback to an input strided array.","C API for registering a Node-API module exporting a strided array interface for applying a unary callback to a double-precision complex floating-point strided input array and assigning results to a double-precision complex floating-point strided output array.","String manipulation functions.","Generate an acronym for a given string.","Base (i.e., lower-level) string functions.","Generate string from a token array by interpolating values.","Tokenize a string into an array of string parts and format identifier objects.","Convert a string to camel case.","Capitalize the first character in a string.","Return a Unicode code point from a string at a specified position.","Convert a string to constant case.","Test if a string ends with the characters of another string.","Insert supplied variable values into a format string.","Create a string from a sequence of Unicode code points.","Convert a string to kebab case.","Left pad a string.","Trim whitespace characters from the beginning of a string.","Trim n characters from the beginning of a string.","Convert a string to lowercase.","Return the next extended grapheme cluster break in a string after a specified position.","Return the number of grapheme clusters in a string.","Pad a string.","Convert a string to Pascal case.","Percent-encode a UTF-16 encoded string according to RFC 3986.","Return the previous extended grapheme cluster break in a string before a specified position.","Remove the first character(s) of a string.","Remove the last character(s) of a string.","Remove punctuation characters from a string.","Remove a UTF-8 byte order mark (BOM) from the beginning of a string.","Remove a list of words from a string.","Repeat a string a specified number of times and return the concatenated result.","Replace search occurrences with a replacement string.","Reverse a string.","Right pad a string.","Trim whitespace characters from the end of a string.","Trim n characters from the end of a string.","Convert a string to snake case.","Split a string by its grapheme cluster breaks.","Capitalize the first letter of each word in a string.","Test if a string starts with the characters of another string.","Return the part of a string after a specified substring.","Return the part of a string after the last occurrence of a specified substring.","Return the part of a string before a specified substring.","Return the part of a string before the last occurrence of a specified substring.","String tools.","Grapheme cluster break tooling.","Trim whitespace characters from the beginning and end of a string.","Truncate a string to a specified length.","Truncate a string in the middle to a specified length.","Uncapitalize the first character of a string.","Convert a string to uppercase.","Convert a UTF-16 encoded string to an array of integers using UTF-8 encoding.","Symbol.","Async iterator symbol.","Symbols.","Symbol iterator.","Time utilities.","Determine the day of the quarter.","Determine the day of the year.","Determine the number of days in a month.","Determine the number of days in a year according to the Gregorian calendar.","Determine the number of hours in a month.","Determine the number of hours in a year according to the Gregorian calendar.","Determine the number of ISO weeks in a year according to the Gregorian calendar.","Determine the number of minutes in a month.","Determine the number of minutes in a year according to the Gregorian calendar.","Time in seconds since the epoch.","Determine the quarter of the year.","Determine the number of seconds in a month.","Determine the number of seconds in a year according to the Gregorian calendar.","Return a high-resolution time.","Return a high-resolution time difference.","stdlib TypeScript type declarations.","Standard utilities.","Test whether at least one element in a collection is truthy.","Test whether at least one element in a collection passes a test implemented by a predicate function.","Test whether at least one element in a collection passes a test implemented by a predicate function, iterating from right to left.","Add elements from one collection to the end of another collection.","Argument function.","Standard async utilities.","Test whether at least one element in a collection passes a test implemented by a predicate function.","Test whether at least one element in a collection passes a test implemented by a predicate function, iterating from right to left.","Split values into two groups according to a predicate function.","Function composition.","Group values according to an indicator function and return group counts.","Invoke a function until a test condition is true.","Invoke a function while a test condition is true.","Test whether all elements in a collection pass a test implemented by a predicate function.","Test whether all elements in a collection pass a test implemented by a predicate function, iterating from right to left.","Invoke a function once for each element in a collection.","Invoke a function once for each element in a collection, iterating from right to left.","Function sequence.","Group values according to an indicator function.","If a predicate function returns a truthy value, return x; otherwise, return y.","If a predicate function returns a truthy value, invoke x; otherwise, invoke y.","Invoke a function for each element in a collection and update the collection in-place.","Invoke a function for each element in a collection and update the collection in-place, iterating from right to left.","Invoke a function n times and return an array of accumulated function return values.","Map keys from one object to a new object having the same values.","Map values from one object to a new object having the same keys.","Test whether all elements in a collection fail a test implemented by a predicate function.","Test whether all elements in a collection fail a test implemented by a predicate function, iterating from right to left.","Apply a function against an accumulator and each element in a collection and return the accumulated result.","Apply a function against an accumulator and each element in a collection and return the accumulated result, iterating from right to left.","Execute functions in series, passing the results of one function as arguments to the next function.","Test whether a collection contains n elements which pass a test implemented by a predicate function.","Test whether a collection contains at least n elements which pass a test implemented by a predicate function, iterating from right to left.","Generate a frequency table according to an indicator function.","If a function does not return an error, invoke a callback with the function result; otherwise, invoke a callback with a value y.","If a function does not return an error, invoke a callback with the function result; otherwise, invoke a second function.","Invoke a function until a test condition is true.","Invoke a function while a test condition is true.","Split values into two groups.","Split values into two groups according to a predicate function.","Split an object's own and inherited property values into two groups according to a predicate function.","Split an object's own property values into two groups according to a predicate function.","Convert the first letter of each object key to uppercase.","Circular buffer.","Return the common own property names of two or more objects.","Return the common own and inherited property names of two or more objects.","Compact adjacency matrix.","Function composition.","Constant function.","Determine the name of a value's constructor.","Convert between POSIX and Windows paths.","Copy or deep clone a value to an arbitrary depth.","Group values according to an indicator function and return group counts.","Transform a function into a sequence of functions each accepting a single argument.","Transform a function into a sequence of functions each accepting a single argument.","Get a nested property value.","Extract a nested property value from each element of an object array.","Set a nested property value.","Define a configurable read-only accessor.","Define a configurable read-only property.","Define a configurable read-write accessor.","Define a configurable write-only accessor.","Define a configurable memoized read-only object property.","Define a memoized object property.","Define a memoized read-only object property.","Define a non-enumerable property.","Define a non-enumerable read-only accessor.","Define a non-enumerable read-only property.","Define a non-enumerable read-write accessor.","Define a non-enumerable write-only accessor.","Define (and/or modify) object properties.","Define (or modify) an object property.","Define a read-only accessor.","Define a read-only property.","Define a read-write accessor.","Define a write-only accessor.","Return a directory name.","Invoke a function until a test condition is true.","Until a test condition is true, invoke a function for each element in a collection.","Until a test condition is true, invoke a function for each element in a collection, iterating from right to left.","Invoke a function while a test condition is true.","While a test condition is true, invoke a function for each element in a collection.","While a test condition is true, invoke a function for each element in a collection, iterating from right to left.","Doubly linked list.","Return an array of an object's own enumerable property key-value pairs.","Return an array of an object's own and inherited enumerable property key-value pairs.","Return an array of an object's own enumerable property names and symbols.","Return an array of an object's own and inherited enumerable property names and symbols.","Return an array of an object's own enumerable symbol properties.","Return an array of an object's own and inherited enumerable symbol properties.","Escape a regular expression string or pattern.","Alias for eval global.","Test whether all elements in a collection are truthy.","Test whether all elements in a collection pass a test implemented by a predicate function.","Test whether all elements in a collection pass a test implemented by a predicate function, iterating from right to left.","Return a filename extension.","First-in-first-out (FIFO) queue.","Create a function that invokes a provided function according to a predicate function.","Find elements in an array-like object that satisfy a test condition.","Flatten an array.","Flatten an object.","Invoke a function for each element in a collection.","Invoke a function for each element in a collection, iterating from right to left.","Invoke a function for each own and inherited enumerable property of an object.","Invoke a function for each own enumerable property of an object.","Create an object from key-value pairs.","Determine a function's name.","Function sequence.","Return the prototype of a provided object.","Return the global object.","Group values as arrays associated with distinct keys.","Group values according to an indicator function.","Group an object's own and inherited property values according to an indicator function.","Group an object's own property values according to an indicator function.","Identity function.","If a condition is truthy, return x; otherwise, return y.","If a condition is truthy, invoke x; otherwise, invoke y.","Return the first index at which a given element can be found.","Implement prototypical inheritance by replacing the prototype of one constructor with the prototype of another constructor.","Return an array of an object's inherited enumerable property names and symbols.","Return an array of an object's inherited enumerable symbol properties.","Return an array of an object's inherited enumerable property names.","Return an array of an object's inherited non-enumerable property names and symbols.","Return an array of an object's inherited non-enumerable property names.","Return an array of an object's inherited non-enumerable symbol properties.","Return an array of an object's inherited property names and symbols.","Return a property descriptor for an object's inherited property.","Return an object's inherited property descriptors.","Return an array of an object's inherited enumerable and non-enumerable property names.","Return an array of an object's inherited symbol properties.","Return an array of an object's inherited writable property names and symbols.","Return an array of an object's inherited writable property names.","Return an array of an object's inherited writable symbol properties.","Invoke a function for each element in a collection and update the collection in-place.","Invoke a function for each element in a collection and update the collection in-place, iterating from right to left.","Convert a collection to an object whose keys are determined by a provided function and whose values are the collection values.","Convert a collection to an object whose keys are determined by a provided function and whose values are the collection values, iterating from right to left.","Return an array of an object's own enumerable property names.","Return an array of an object's own and inherited enumerable property names.","Load a manifest for compiling source files.","Linked list.","Convert each object key to lowercase.","Apply a function to each element in an array and assign the result to an element in an output array.","Create a function that applies arguments to a provided function after transforming arguments according to a callback function.","Invoke a function n times and return an array of accumulated function return values.","Map keys from one object to a new object having the same values.","Perform a single-pass map-reduce operation against each element in an array and return the accumulated result.","Perform a single-pass map-reduce operation against each element in an array while iterating from right to left and return the accumulated result.","Apply a function to each element in an array and assign the result to an element in an output array, iterating from right to left.","Map values from one object to a new object having the same keys.","Apply a function to elements in two input arrays and assign the results to an output array.","Apply a function to elements in two input arrays while iterating from right to left and assign the results to an output array.","Apply a function to each nested element in an array of arrays and assign the result to a nested element in a new array of arrays.","Apply a function to each nested element in a three-dimensional nested array and assign the result to a nested element in a new three-dimensional nested array.","Apply a function to each nested element in a four-dimensional nested array and assign the result to a nested element in a new four-dimensional nested array.","Apply a function to each nested element in a five-dimensional nested array and assign the result to a nested element in a new five-dimensional nested array.","Create a function that invokes a provided function according to an argument mask.","Memoize a function.","Merge and extend objects.","Move a property from one object to another object.","Named typed tuple.","Create a function that invokes a provided function with a specified number of arguments.","Determine the specification defined classification of an object.","Add a callback to the next tick queue.","Test whether all elements in a collection are falsy.","Test whether all elements in a collection fail a test implemented by a predicate function.","Test whether all elements in a collection fail a test implemented by a predicate function, iterating from right to left.","Return an array of an object's own non-enumerable property names and symbols.","Return an array of an object's own and inherited non-enumerable property names and symbols.","Return an array of an object's own non-enumerable property names.","Return an array of an object's own and inherited non-enumerable property names.","Return an array of an object's own non-enumerable symbol properties.","Return an array of an object's own and inherited non-enumerable symbol properties.","Return an array of an object's own enumerable property names which are not integer indices.","Function which does nothing.","Invert an object, such that keys become values and values become keys.","Invert an object, such that keys become values and values become keys, according to a transform function.","Return a partial object copy excluding specified keys.","Return a partial object copy excluding properties for which a predicate (function) returns a truthy value.","Open a URL.","Partially apply function arguments.","Partially apply function arguments from the right.","Execute scripts in parallel.","Parse a string as JSON.","Return a partial object copy containing only specified keys.","Create a function that invokes a provided function with specified arguments.","Return a partial object copy containing properties for which a predicate (function) returns a truthy value.","Extract a property value from each element of an object array.","Remove and return the last element of a collection.","Add elements from one collection to the beginning of another collection.","Return an array of an object's own enumerable and non-enumerable property names and symbols.","Return an array of an object's own and inherited property names and symbols.","Return a property descriptor for an object's own property.","Return a property descriptor for an object's own or inherited property.","Return an object's own property descriptors.","Return an object's own and inherited property descriptors.","Return an array of an object's own enumerable and non-enumerable property names.","Return an array of an object's own and inherited enumerable and non-enumerable property names.","Return an array of an object's own symbol properties.","Return an array of an object's own and inherited symbol properties.","Add one or more elements to the end of a collection.","Return the maximum finite value capable of being represented by a numeric real type.","Return the smallest positive normal value capable of being represented by a numeric real type.","Apply a function against an accumulator and each element in an array and return the accumulated result.","Apply a function against an accumulator and each element in an array while iterating from right to left and return the accumulated result.","Reduce the number of dimensions by one of a two-dimensional nested array by applying a function against an accumulator and each element along the innermost dimension and returning the accumulation results as a one-dimensional array.","Create a regular expression from a regular expression string.","Create a function that invokes a provided function according to a predicate function.","Create a function that invokes a provided function with reordered arguments.","Create a function that invokes a provided function with arguments in reverse order.","Return the maximum safe integer capable of being represented by a numeric real type.","Return the minimum safe integer capable of being represented by a numeric real type.","Remove and return the first element of a collection.","Return the size (in bytes) of the canonical binary representation of a specified numeric type.","Test whether a collection contains at least n elements which are truthy.","Test whether a collection contains at least n elements which pass a test implemented by a predicate function.","Test whether a collection contains at least n elements which pass a test implemented by a predicate function, iterating from right to left.","Stack.","Generate a frequency table.","Generate a frequency table according to an indicator function.","Time a snippet.","If a function does not throw, return the function return value; otherwise, return y.","Wrap a function in a try/catch block.","Wrap require in a try/catch block.","If a function does not throw, return the function return value; otherwise, return the return value of a second function.","Return the maximum value of a specified numeric type.","Return the minimum value of a specified numeric type.","Determine a value's type.","Convert the first letter of each object key to lowercase.","Transform a curried function into a function invoked with multiple arguments.","Transform a curried function into a function invoked with multiple arguments.","Add one or more elements to the beginning of a collection.","Invoke a function until a test condition is true.","Until a test condition is true, invoke a function for each element in a collection.","Until a test condition is true, invoke a function for each element in a collection, iterating from right to left.","Unzip a zipped array (i.e., a nested array of tuples).","Convert each object key to uppercase.","Return an array of an object's own enumerable property values.","Return an array of an object's own and inherited enumerable property values.","Invoke a function while a test condition is true.","While a test condition is true, invoke a function for each element in a collection.","While a test condition is true, invoke a function for each element in a collection, iterating from right to left.","Return an array of an object's own writable property names and symbols.","Return an array of an object's own and inherited writable property names and symbols.","Return an array of an object's own writable property names.","Return an array of an object's own and inherited writable property names.","Return an array of an object's own writable symbol properties.","Return an array of an object's own and inherited writable symbol properties.","Generate array tuples from input arrays."]